[
{
    "title": "Software Engineer, Fullstack",
    "company": "Grab",
    "location": "Vietnam",
    "date_posted": "2025-05-30",
    "job_url": "https://vn.linkedin.com/jobs/view/software-engineer-fullstack-at-grab-4237641412?position=9&pageNum=0&refId=yEZjo%2BIez2aR1YOZPIU%2BxQ%3D%3D&trackingId=JCrtTkb9k3Q2qvyZhMeB8w%3D%3D",
    "company_logo": null,
    "job_type": "Full-time",
    "job_level": "Associate",
    "competencies": {
        "programming_languages": [
            "GO"
        ],
        "frameworks": [
            "ReactJS",
            "Redux"
        ],
        "platforms": [],
        "tools": [],
        "knowledge": [
            "Algorithms",
            "Data Structures"
        ],
        "soft_skills": [
            "Communication",
            "Teamwork",
            "Mentoring"
        ],
        "certifications": []
    },
    "company_addresses": null,
    "company_description": "About Grab and Our Workplace\nGrab is Southeast Asias leading superapp. From getting your favourite meals delivered to helping you manage your finances and getting around town hassle-free, weve got your back with everything. In Grab, purpose gives us joy and habits build excellence, while harnessing the power of Technology and AI to deliver the mission of driving Southeast Asia forward by economically empowering everyone, with heart, hunger, honour, and humility.",
    "description": "**Get to know the team**\nThe Outbound Communication team develops high-throughput solutions that allow the delivery of transactional and marketing messages, including push notifications, emails, SMS, and more, to millions of users, while also improving in-app communication experiences. We take pride in building distributed systems that have a impact on the lives of millions of users in our endeavor to out-serve the underserved population. We are made up of young and experienced, skillful backend, frontend and mobile developers. If you are looking for a friendly environment where tech and business are combined join our team!\n\n**Get to know the role**\nWe are looking for passionate developers with the required skills and then some to join our team. You will have opportunities to design backend components and services. Not only will you get to collaborate with the product, business, and program management teams to be on top of your deliverables, but you will also serve as a mentor to your teammates to help meet the teams deliverables and goals. You will report to the Engineering Manager. You will be based in HCMC and you will work in the office\n\n**The Critical tasks you will perform**\n*   Design and write with the modern GO language to improve the availability, scalability, latency, and efficiency of our range of services.\n*   Work with the engineering team to explore and create new design/architecture geared towards scale and performance.\n*   Participate in code and design reviews to maintain our high development standards.\n*   Participate in service capacity and demand planning, software performance analysis, tuning, and optimization.\n*   Collaborate with product and experience teams to define and prototype feature specifications\n*   Work with the infrastructure team in building and scaling back-end services and performing root cause analysis investigations.\n*   Develop, analyze and fix large-scale systems.\n*   You are required to participate in team on-call rotation to help us achieve operational excellence.\n\n**Qualifications**\n\n**The must-haves**\n*   A degree in Computer Science, Software Engineering, Information Technology, or related fields with Computer Science fundamentals in algorithms and data structures.\n*   At least 1 year of experience in software engineering in a distributed systems environment.\n*   Have excellent experience communicating updates and resolutions to customers and other partners, of the current system regarding growth and stability.\n*   You are proficient in at least one programming language and the fundamentals of CS such as Data Structures, Algorithms, Operating Systems\n*   You have a working knowledge of building backend systems around DBMS, Caches, NoSQL, Web, and App servers.\n*   Expertise in web development, including ReactJS, Redux."
},
{
    "title": "Fresher Software Developer (Low code platform)",
    "company": "KMS Technology, Inc.",
    "location": "Ho Chi Minh City, Vietnam",
    "date_posted": "2025-05-04",
    "job_url": "https://vn.linkedin.com/jobs/view/fresher-software-developer-low-code-platform-at-kms-technology-inc-4219141436?position=7&pageNum=0&refId=yEZjo%2BIez2aR1YOZPIU%2BxQ%3D%3D&trackingId=dl1IGNhiYY67BcYpDgvalg%3D%3D",
    "company_logo": null,
    "job_type": "Full-time",
    "job_level": "Entry-level",
    "competencies": {
        "programming_languages": [
            "C#",
            ".NET",
            "Java",
            "Python",
            "C#"
        ],
        "frameworks": [],
        "platforms": [],
        "tools": [],
        "knowledge": [
            "software development good practices",
            "software design patterns"
        ],
        "soft_skills": [
            "Problem-solving",
            "teamwork"
        ],
        "certifications": []
    },
    "company_addresses": null,
    "company_description": "KMS Technology\nwas established in 2009 as a U.S.-based software services company. With development centers in Vietnam and Mexico, we have been trusted globally for the superlative quality of our software consulting & development services, technology solutions, and engineers expertise.We pride ourselves on creating brilliant solutions for our clients by leveraging deep expertise, advanced technologies, and delivery excellence for a shared success where everyone can reach their fullest potential. With three Business Lines:\nKMS Software:Leverage software domain expertise to help clients make better business decisions in technology platforms, increase speed-to-market, and gain critical development support through innovative technology solutions.\nKMS Solutions:Empower BFSI businesses to embrace the digital finance revolution and expedite clients’ journey towards complete digitalization, technology consulting, data analytics, software development, and software quality.\nKMS Healthcare:Build transformative next-gen technologies to solve healthcare’s most challenging problems, providing innovative tools and expertise to providers, payers, life sciences, and medical technology vendors.",
    "description": "Your key responsibilities:\nThe Fresher Software Developer will be responsible for developing and maintaining applications using a low-code development platform, setting up and configuring systems for each customers unique requirements.\n\nIf you are naturally drawn to technology and understanding it, and if you are looking for an opportunity in a fast-paced software development environment where you can develop your technical skills and soft skills in parallel, then you might be a match\n\n**General requirements:**\n\n*   Good IT background, GPA 7.5+ (Please attach transcripts when submitting your CV)\n*   Problem-solving skills and solution-oriented attitude\n*   Ability to work independently and in a team setting\n*   Good English skills\n*   Ready to work full-time\n\n**Technical requirements:**\n\n*   Having experience with one programming language (C#, .NET, Java, Python) and a drive to learn and work with C#\n*   Theoretical knowledge of software development good practices and basic software design patterns\n\n**Perks Youll Enjoy**\n\n*   Working in one of the Best Places to Work in Vietnam\n*   Building large-scale & global software products\n*   Working & growing with Passionate & Talented Team\n*   Diverse careers opportunities with Software Outsourcing, Software Product Development, IT Solutions & Consulting\n*   Attractive Salary and Benefits\n*   Two performance appraisals every year and performance bonus\n*   Onsite opportunities: short-term and long-term assignments in North American (U.S, Canada), Europe, Asia.\n*   Flexible working time\n*   Various training on hot-trend technologies, best practices and soft skills\n*   Premium healthcare insurance for you and your loved ones\n*   Company trip, big annual year-end party every year, team building, etc.\n*   Fitness & sport activities: football, tennis, table-tennis, badminton, yoga, swimming…\n*   Joining community development activities: 1% Pledge, charity every quarter, blood donation, public seminars, career orientation talks,…\n*   Free in-house entertainment facilities (foosball, ping pong, gym…), coffee, and snack (instant noodles, cookies, candies…)\n*   And much more, join us and let yourself explore other fantastic things!"
},
{
    "title": "BACKEND DEVELOPER (LEVEL FRESHER - JUNIOR)",
    "company": "Monkey Vietnam",
    "location": "Hanoi, Vietnam",
    "date_posted": "2025-05-14",
    "job_url": "https://vn.linkedin.com/jobs/view/backend-developer-level-fresher-junior-at-monkey-vietnam-4223320881?position=2&pageNum=0&refId=yEZjo%2BIez2aR1YOZPIU%2BxQ%3D%3D&trackingId=h3axEHd%2F9qHWEIccz2qpjw%3D%3D",
    "company_logo": null,
    "job_type": "Full-time",
    "job_level": "Entry-level",
    "competencies": {
        "programming_languages": [
            "Go",
            "PHP"
        ],
        "frameworks": [],
        "platforms": [],
        "tools": [],
        "knowledge": [
            "Big Data",
            "API"
        ],
        "soft_skills": [
            "Self-learning",
            "High pressure resistance"
        ],
        "certifications": []
    },
    "company_addresses": null,
    "company_description": null,
    "description": "## Job Description\n\n*   Learn and practice how to analyze, design, and build systems for operating and managing learning programs (CMS), customer information (CRM), and design and develop APIs for Mobile Apps.\n*   Participate in learning and analyzing big data to optimize and personalize the experience of millions of users.\n*   Opportunity to access, learn, and research new technologies to apply to projects.\n\n## Requirements\n\n*   4th-year students about to graduate or new graduates.\n*   Priority is given to candidates with 6 months of experience or more.\n*   Passionate about programming, with good logical thinking, self-learning ability, and ability to work under high pressure.\n*   Basic knowledge of one of the languages: Go or PHP.\n*   Good English is an advantage.\n*   Send CV to email: phuong.tran@monkey.edu.vn\n\n## Benefits\n\n*   Salary from 7,000,000 - 15,000,000 VND/month.\n*   Signing Bonus of 1/2 months salary upon passing probation.\n*   Allowance of 1,000,000 VND/month for lunch and transportation.\n*   Large data warehouse, with products used by over 15 million users.\n*   Mentor with good expertise & creates conditions to develop personal capacity.\n*   Opportunity to research and improve AI application skills.\n*   Unlimited use of Monkey products.\n*   Working at a company that has won many prestigious awards such as the First Prize for Global Initiative in the US awarded by US President Barack Obama; First Prize of Vietnamese Talent; Top 1 favorite childrens app on the App Store and Google Play.\n*   Working in a positive, open environment, ready to listen and share from bosses to colleagues.\n*   Sponsored costs for courses to develop personal expertise.\n*   Annual salary review.\n*   Productivity bonus, project bonus, innovation bonus, acceleration bonus, hot bonus, bonus when thinking of new ways to reward; gifts and bonuses for holidays and Tet.\n*   Equipped with equipment for work or allowance if using personal equipment.\n*   Full number of days of leave, holidays, Tet, personal leave according to the provisions of the Labor Law.\n*   Attractive maternity regime for men and women.\n*   Enjoy social insurance, health insurance, unemployment insurance and other benefits according to the companys regulations.\n*   Periodic health check-ups with high-quality examination packages at major medical facilities.\n*   Enjoy joy not just benefits: Teabreak, parties, birthdays, annual travel.\n*   And many other attractive welfare policies will be discussed at the Interview.\n"
},
{
    "title": "Software Developer (Vietnam)",
    "company": "Azeus Systems Limited",
    "location": "Ho Chi Minh City, Vietnam",
    "date_posted": "2025-05-29",
    "job_url": "https://vn.linkedin.com/jobs/view/software-developer-vietnam-at-azeus-systems-limited-4236579788?position=6&pageNum=0&refId=yEZjo%2BIez2aR1YOZPIU%2BxQ%3D%3D&trackingId=RyrFWvcOn2RMr6VcZ0dHrg%3D%3D",
    "company_logo": null,
    "job_type": "Full-time",
    "job_level": null,
    "competencies": {
        "programming_languages": [
            "Java"
        ],
        "frameworks": [],
        "platforms": [],
        "tools": [],
        "knowledge": [],
        "soft_skills": [
            "Problem-solving",
            "Communication",
            "Fast learner",
            "Self-managing",
            "Collaboration"
        ],
        "certifications": []
    },
    "company_addresses": null,
    "company_description": null,
    "description": "Responsibilities:\n\n*   Full stack systems development\n*   Technical investigation/research, risk assessment, estimation, and recommendation\n*   Development of prototypes and proof-of-concept applications for technical proposals and demos\n*   Program documentation\n*   Product maintenance, support, and enhancement\n*   Troubleshoot and debug existing systems\n*   System migration and upgrade\n\nQualifications:\n\n*   Bachelors degree in Computer Sciences, Computer Engineering, or any course related to Information Technology, Engineering, and Mathematics.\n*   Excellent programming and problem-solving skills\n*   Ability to develop software in Java or other enterprise programming languages\n*   Ability to contribute to different phases of the software development life cycle (SDLC) or product development\n*   Ability to communicate in English, verbal and written, in a concise and clear manner\n*   Fast learner, detail-oriented\n*   Able to work under pressure\n*   Self-managing and able to collaborate with offsite team members\n*   Can render extra hours whenever necessary\n*   (Fresh graduates are encouraged to apply)\n\nWhats in it for you:\n\n*   Competitive salary package\n*   Exposure to a variety of technologies and roles\n*   Abundant opportunities to upskill and grow on the job\n*   Being part of a global team of competent IT professionals\n*   Being part of the companys continuous growth and R&D on new technologies\n*   An environment focused on quality and streamlined processes: CMMI Level 5\n*   Family-like work environment\n*   Semi-flexible work schedule"
},
{
    "title": "Web App Developer",
    "company": "Samsung Southeast Asia & Oceania",
    "location": "Ho Chi Minh City Metropolitan Area",
    "date_posted": "2025-01-04",
    "job_url": "https://vn.linkedin.com/jobs/view/web-app-developer-at-samsung-southeast-asia-oceania-4097982688?position=7&pageNum=1&refId=82A%2BRMx58uSCqbk%2Bsf3BZw%3D%3D&trackingId=aVPvW6JTMfZyjH3I2seRbQ%3D%3D",
    "company_logo": null,
    "job_type": "Full-time",
    "job_level": "Entry-level",
    "competencies": {
        "programming_languages": [
            "JavaScript",
            "Typescript",
            "HTML5"
        ],
        "frameworks": [
            "Antd design",
            "Tailwind",
            "flow bite",
            "material design"
        ],
        "platforms": [],
        "tools": [
            "ESLint",
            "Jest",
            "Mocha",
            "Cypress",
            "Webpack",
            "Git",
            "SVN"
        ],
        "knowledge": [
            "Clean Architecture",
            "design patterns",
            "MVC",
            "MVVM",
            "OOP",
            "CI/CD principles",
            "IoT connection",
            "Bluetooth",
            "Socket",
            "MQTT",
            "IoT server",
            "WebRTC",
            "Algorithm",
            "Data Structures"
        ],
        "soft_skills": [
            "problem analysis",
            "problem resolution"
        ],
        "certifications": []
    },
    "company_addresses": null,
    "company_description": null,
    "description": "**Position Summary**\n\n**Role and Responsibilities**\n\n**JOB RESPONSIBILITIES:**\n\n*   Develop and maintain web-based mobile applications for smart devices and robot.\n*   Actively participate in the development process, taking responsibility for and completing assigned tasks.\n*   Analyze and effectively solve problems that arise during project development.\n*   Research, propose and implement solutions to improve project quality.\n*   Collaborate, support team members and other departments during work.\n\n**Skills And Qualifications**\n\n**KNOWLEDGE, QUALIFICATION AND EXPERIENCE**\n\n**General Requirement**\n\n*   Bachelor’s degree in computer science, Software Engineering or a related IT field.\n*   At least 1 year of experience in software development.\n*   Proficient in English for work purposes.\n*   Strong skills in problem analysis and resolution.\n*   Fast learner with a mindset geared toward quickly understanding new technologies and product modules.\n*   Ability to multi-task and manage tasks with varying priorities.\n*   Tech-savvy and passionate about building products.\n*   Proactive at work\n\n**Technical Requirement**\n\n**(Mandatory)**\n\n*   Knowledge in Web application technical programing: JavaScript, Typescript, CSS, HTML5, …\n*   Good at handling Web applications across multiple screens size.\n*   Familiarity with ESLint for maintaining code quality and style.\n*   Experience in using and customizing component UI frameworks such as Antd design, Tailwind - flow bite, material design.\n*   Understanding of W3C standards and experience in handling W3 error compliance.\n*   Experience in writing and executing unit tests for web applications (Jest, Mocha, Cypress).\n*   Knowledgeable in Clean Architecture, design patterns (MVC, MVVM) and OOP.\n*   Experience with distributed version control systems (Git, SVN).\n\n**(Optional)**\n\n*   Proficient in using Webpack for module bundling and optimizing web applications.\n*   Strong understanding of CI/CD principles.\n*   Knowledge & experience of handling IoT connection: Bluetooth, Socket, MQTT, IoT server\n*   Have experience of chat application (WebRTC, …)\n*   Have experience of software quality & performance\n*   Knowledge of image/video detection libraries (OpenCV, TensorFlow) will be highly appreciated\n*   Experience in Android/IOS development (native & cross-platform) is big plus\n*   Familiar with Algorithm or have high level on Coding challenge platform like Leet code, Hacker Rank is a big plus\n\nEMAIL: NGUYEN.LT@SAMSUNG.COM\n\nPlease visit Samsung membership to see Privacy Policy, which defaults according to your location. You can change Country/Language at the bottom of the page. If you are European Economic Resident, please click here."
},
{
    "title": "Software Engineer (Frontend - Pluto Connect)",
    "company": "Pluto",
    "location": "Vietnam",
    "date_posted": "2025-03-04",
    "job_url": "https://vn.linkedin.com/jobs/view/software-engineer-frontend-pluto-connect-at-pluto-4157199203?position=1&pageNum=1&refId=82A%2BRMx58uSCqbk%2Bsf3BZw%3D%3D&trackingId=dNmQOLUNBqGc5Mh4CF1JZg%3D%3D",
    "company_logo": null,
    "job_type": "Full-time",
    "job_level": "Mid-Senior level",
    "competencies": {
        "programming_languages": [
            "TypeScript",
            "Kotlin"
        ],
        "frameworks": [
            "React",
            "GraphQL"
        ],
        "platforms": [
            "AWS",
            "Azure",
            "Kubernetes"
        ],
        "tools": [
            "Terraform",
            "Datadog",
            "Cloudwatch",
            "Lightstep",
            "Git"
        ],
        "knowledge": [
            "Algorithms",
            "Data Structures",
            "Web fundamentals",
            "Web performance",
            "Software design patterns",
            "Architecture"
        ],
        "soft_skills": [
            "Communication",
            "Collaboration",
            "Problem-solving",
            "Analytical skills"
        ],
        "certifications": []
    },
    "company_addresses": null,
    "company_description": "Pluto is a modern financial operating system for global businesses. We combine global payments infrastructure with intelligent workflow automation to provide businesses with unparalleled insights, control, and automation over their spending.\n\nPluto is a venture-capital funded startup backed by top-tier Silicon Valley investors and built by folks from some of the best technology institutions in the world -- Google, Shopify, Square, Uber, PayPal, Cash App, Digital Ocean, Y Combinator, and more\n\nWe are reinventing corporate finance for the modern age and are solving challenging problems in the B2B payments space. With a stronghold in Dubai and sights set on expansion, were now looking for a seasoned frontend engineer to help shape our next chapter",
    "description": "## Job Role\n\nAs a Frontend Engineer, you will be developing cutting-edge web applications and libraries for Pluto Connect - our modern embedded spend management platform for banks and financial institutions. This role involves collaborating with high-performing cross-functional teams and external stakeholders to build and ship high-impact integration projects.\n\n## Key Responsibilities\n\n*   Develop and maintain complex software applications using React, Typescript, and GraphQL\n*   Lead the development lifecycle of features and work streams from design to deployment\n*   Collaborate with product managers, designers, and backend engineers to deliver world-class products\n*   Become a voracious problem solver who can tackle difficult issues on tight timelines, manage cross-functional dependencies and set an exemplary bar for engineering within the organization\n*   Write and maintain clean, maintainable and testable code, leveraging design patterns and architecture where appropriate\n*   Participate in code reviews, pair-programming sessions and provide constructive feedback to peers\n*   Develop a strong understanding of the domain and bring a deep product and design mindset while building solutions\n\n## Candidate Profile\n\n*   Bachelor’s or Master’s degree in Computer Science, Software Engineering or related field\n*   Strong fundamentals in computer science, algorithms and data structures\n*   3+ years of experience in software development\n*   Experienced in React and Typescript, familiar with GraphQL\n*   Strong understanding of web fundamentals, web performance, software design patterns and architecture\n*   Experience with modern front-end development tools and frameworks\n*   Excellent problem-solving and analytical skills\n*   Excellent communication and collaboration skills\n*   Experience working with nimble, cross-functional teams with high shipping velocity\n\n## Our Tech Stack\n\n*   Frontend: React, TypeScript, GraphQL\n*   Backend: Kotlin, GraphQL, Temporal\n*   Database: Postgres\n*   Infrastructure: AWS, Azure, Kubernetes, Terraform\n*   Observability: Datadog, Cloudwatch, Lightstep\n\n## Our Values\n\nAt Pluto, we live by the following core values:\n\n*   Work like a lion, not like a cow 🦁\n*   Directly Responsible Individuals (DRI): We empower team members with autonomy to own their projects and outcomes fully, fostering a culture of accountability, clarity and outsized impact. As the DRI you are the driver of success for your projects — proactively identifying, communicating and mitigating risks and resolving blockers to ensure success.\n*   Clear Communication: At Pluto, we emphasize clear, transparent communication as fundamental to our success. We strive for clarity, succinctness and transparency in all interactions, ensuring that every message is articulated clearly and understood universally across our teams. This commitment to clarity reduces misunderstandings and fosters a more productive environment especially for distributed teams.\n*   Systems Thinking & First Principles Reasoning: We love to deconstruct problems and innovate from the ground up. By understanding complex systems and questioning assumptions, we are able to develop creative solutions to difficult problems.\n*   Fact-centric: We are intentional about questioning our assumptions, and bringing the facts to focus by diving into the data, quick-fire experimentation & swift prototyping. We make room for varied perspectives & calibrate our goals with metrics that track our progress, and accurately reflect reality.\n\n## Benefits\n\n*   Competitive compensation & stock options so you have skin in the game\n*   Remote-first work environment\n*   Well ship you a new MacBook\n*   Monthly fitness benefit\n*   Home-office budget\n*   Discretionary learning budget"
},
{
    "title": "[LTS] Developer NodeJS",
    "company": "LTS Group",
    "location": "Hanoi, Vietnam",
    "date_posted": "2025-02-04",
    "job_url": "https://vn.linkedin.com/jobs/view/lts-developer-nodejs-at-lts-group-4138915105?position=10&pageNum=1&refId=82A%2BRMx58uSCqbk%2Bsf3BZw%3D%3D&trackingId=GnIagtpABXsvsOHQCnlXlA%3D%3D",
    "company_logo": null,
    "job_type": "Full-time",
    "job_level": "Entry-level",
    "competencies": {
        "programming_languages": [
            "NodeJS",
            "Javascript"
        ],
        "frameworks": [
            "React",
            "Express",
            "Graphql",
            "React hooks"
        ],
        "platforms": [],
        "tools": [],
        "knowledge": [],
        "soft_skills": [],
        "certifications": []
    },
    "company_addresses": null,
    "company_description": null,
    "description": "Position :\nNodeJS Developer\n\nQuantity : 03\n\nType : Full-time\n\nLocation: 68 Nguyen Co Thach street, Ha Noi.\n\n**Job Description**\n\n*   Participate in development projects for Web applications, Mobile Applications\n*   Able to take the role of technical leader of the project, and propose technical solutions for various problems\n*   Coaching project members\n*   Perform design, implement coding, testing, and documentation in line with user & system requirements to deliver source code that meets the needs and release milestone\n*   Perform bugs fixing, maintaining, and enhancement\n\n**Requirement**\n\n*   At least 1 year of commercial experience with NodeJS\n*   Integration of user-facing elements developed by front-end developers with server-side logic\n*   Writing reusable, testable, and efficient code\n*   Design and implementation of low-latency, high-availability, and performant applications\n*   Experience with web applications fundamentals like React, React hooks\n*   Experience with Javascript, Express, Graphql\n*   Experience with MongoDB\n*   Strong ability to understand existing code and fix bugs and write enhancements (without rewriting code)\n*   ENGLISH is plus\n\n**Benefits**\n\n*   Attractive salary (upto 2000$). Performance based award.\n*   Young and dynamic working environment.\n*   Continuous development of hard and soft skills through work and professional trainings.\n*   Opportunity to approach newest technology trends\n*   Salary review 2 times/year or on excellent performance\n*   Company’s labor policy completely pursuant to Vietnamese labor legislation plus other benefits offered by the company (Company trip, Holiday, etc.)\n\n**CONTACT**\n\nLTS Recruitment Department\n\nPhone Number: 02466607474\n\nEmail: rec@ltsgroup.tech"
},
{
    "title": "Web Developers (PHP/.Net)",
    "company": "Vidaltek",
    "location": "Ho Chi Minh City, Vietnam",
    "date_posted": "2024-07-04",
    "job_url": "https://vn.linkedin.com/jobs/view/web-developers-php-net-at-vidaltek-3984643773?position=6&pageNum=1&refId=82A%2BRMx58uSCqbk%2Bsf3BZw%3D%3D&trackingId=2d7tDTMQk8LuRPAQrP5sag%3D%3D",
    "company_logo": null,
    "job_type": "Full-time",
    "job_level": "Entry-level",
    "competencies": {
        "programming_languages": [
            "PHP",
            ".Net",
            "HTML",
            "JavaScript",
            "MySQL",
            "SQL Server"
        ],
        "frameworks": [],
        "platforms": [],
        "tools": [],
        "knowledge": [],
        "soft_skills": [],
        "certifications": []
    },
    "company_addresses": null,
    "company_description": null,
    "description": "## Job Description\n\nUnder general direction, the PHP or .NET Developer will design, develop, and produce a variety of web applications to support company and client needs.\n\n*   Build user interface applications and back-end databases using PHP, HTML, JavaScript and MySQL or .NET and SQL Server\n*   Participate in all phases of project lifecycle: planning, designing, developing, testing, debugging, maintaining, and updating.\n\nCollege degree"
},
{
    "title": "Backend Engineer Intern (Full-time)",
    "company": "FireGroup Technology",
    "location": "Ho Chi Minh City, Vietnam",
    "date_posted": "2025-05-28",
    "job_url": "https://vn.linkedin.com/jobs/view/backend-engineer-intern-full-time-at-firegroup-technology-4237936622?position=3&pageNum=1&refId=82A%2BRMx58uSCqbk%2Bsf3BZw%3D%3D&trackingId=3Jkw%2BDizMJadB1zuFJNR1A%3D%3D",
    "company_logo": null,
    "job_type": "Full-time",
    "job_level": "Intern",
    "competencies": {
        "programming_languages": [
            "PHP",
            "JavaScript",
            "NodeJS"
        ],
        "frameworks": [],
        "platforms": [],
        "tools": [],
        "knowledge": [
            "Databases",
            "PostgreSQL",
            "MySQL"
        ],
        "soft_skills": [
            "Problem-Solving",
            "Teamwork",
            "Communication",
            "Collaboration"
        ],
        "certifications": []
    },
    "company_addresses": null,
    "company_description": "FireGroup envisions and strives to shape a world where e-commerce is easy, effective, and sustainable. Since our founding in 2016, we have specialized in providing a comprehensive portfolio of category-leading SaaS products for the global e-commerce market, including online store development, store management, sales & marketing automation, and almost every aspect of running an online business. After almost a decade in the market, we are loved by over 450,000 merchants and enterprises across 175+ countries and highly trusted by our globally renowned partners such as Shopify, BigCommerce, WooCommerce, Google, Meta, Tiktok, and Amazon.\n\nAs we continue on our development path, we relentlessly overcome challenges to develop innovative products that comprehensively and effectively solve problems in e-commerce, making online business easy and sustainable for everyone. Together, we aspire to build a future in which FireGroup emerges as a global leader in e-commerce innovation, offering world-class products trusted by industry experts around the world.",
    "description": "Apply Now\n\nHo Chi Minh\n\nFull-time\n\n26/05/2025\n\n**About Firegroup Technology**\n\nFireGroup envisions and strives to shape a world where e-commerce is easy, effective, and sustainable. Since our founding in 2016, we have specialized in providing a comprehensive portfolio of category-leading SaaS products for the global e-commerce market, including online store development, store management, sales & marketing automation, and almost every aspect of running an online business. After almost a decade in the market, we are loved by over 450,000 merchants and enterprises across 175+ countries and highly trusted by our globally renowned partners such as Shopify, BigCommerce, WooCommerce, Google, Meta, Tiktok, and Amazon.\n\nAs we continue on our development path, we relentlessly overcome challenges to develop innovative products that comprehensively and effectively solve problems in e-commerce, making online business easy and sustainable for everyone. Together, we aspire to build a future in which FireGroup emerges as a global leader in e-commerce innovation, offering world-class products trusted by industry experts around the world.\n\n**Why to build your career with us**\n\n*   Make your impact globally on hundreds of thousands of merchants’ success\n*   Develop your skills in a fast-paced and highly competitive SaaS market\n*   Create and grow continuously among passionate talents with growth mindsets\n\n**Responsibilities**\n\n*   **PHP/ NodeJS Development:** Learn and apply PHP, JavaScript programming language to develop backend services\n*   **Database Interactions:** Learn to work with databases (e.g., PostgreSQL, MySQL) to store and retrieve data.\n*   **Code Review and Improvement:** Participate in code reviews to learn best practices and improve code quality.\n*   **Testing and Debugging:** Assist in writing unit and integration tests to ensure code reliability.\n*   **Problem-Solving:** Collaborate with the team to identify and solve technical challenges.\n\n**Qualifications**\n\n*   **Strong Academic Foundation:** Pursuing a degree in Computer Science, Software Engineering, or a related field.\n*   **Problem-Solving Skills:** Ability to analyze problems and propose solutions.\n*   **Teamwork:** Effective communication and collaboration skills.\n*   **Curiosity and Learning Mindset:** Eagerness to learn new technologies and improve skills.\n\n**Benefits**\n\n*   Dynamic working environment, many challenging opportunities, empowered to improve skills and abilities.\n*   Gain practical, real-world experience in a dynamic E-commerce/ Technology environment.\n*   Participate in the internal activities and additional benefits of the Company.\n*   Build up a quality professional network.\n*   Internship allowance.\n\nThank you for your interest in the Backend Engineer Intern position at FireGroup Technology!\n\nPlease complete the FORM to help FireGroup assess your suitability for the role.\n\n**Contacts**\n\nShould you need more information about this job, reach out to us at:\n\nTalent Acquistion team\n\nFireGroup’s Linkedin fanpage"
},
{
    "title": "Junior Developer (Javascript & HTML)",
    "company": "SOCOTEC",
    "location": "Dinh Ba, Hanoi, Vietnam",
    "date_posted": "2025-05-30",
    "job_url": "https://vn.linkedin.com/jobs/view/junior-developer-javascript-html-at-socotec-4209738941?position=8&pageNum=0&refId=yEZjo%2BIez2aR1YOZPIU%2BxQ%3D%3D&trackingId=X67B%2FgB1bz87YvCgjAv6Tw%3D%3D",
    "company_logo": null,
    "job_type": "Full-time",
    "job_level": "Junior",
    "competencies": {
        "programming_languages": [
            "JavaScript",
            "HTML",
            "XML",
            "SQL"
        ],
        "frameworks": [],
        "platforms": [],
        "tools": [],
        "knowledge": [
            "database design",
            "relational databases",
            "Networking"
        ],
        "soft_skills": [
            "Problem-solving",
            "Teamwork",
            "collaboration"
        ],
        "certifications": []
    },
    "company_addresses": null,
    "company_description": "The SOCOTEC Group offers its customers and partners missions throughout the life cycle of infrastructure and buildings to ensure compliance, extend their lifespan, improve their technical, energy and environmental performance, and thus guarantee the safety of people. Independent trusted third party and with offices in 26 countries and more than 11,300 people.\nSOCOTEC is a leading player in risk management and technical advice in the world. Established in Vietnam since 2018, SOCOTEC Vietnam works closely with colleagues in France, Germany, Italy, UK, USA, Spain, Netherlands and other SOCOTEC offices. For our office in Hanoi, we are looking immediately for a Technical Reporting Engineer",
    "description": "**Description Du Poste**\n\n**Company Description**\nThe SOCOTEC Group offers its customers and partners missions throughout the life cycle of infrastructure and buildings to ensure compliance, extend their lifespan, improve their technical, energy and environmental performance, and thus guarantee the safety of people. Independent trusted third party and with offices in 26 countries and more than 11,300 people.\n\nSOCOTEC is a leading player in risk management and technical advice in the world. Established in Vietnam since 2018, SOCOTEC Vietnam works closely with colleagues in France, Germany, Italy, UK, USA, Spain, Netherlands and other SOCOTEC offices. For our office in Hanoi, we are looking immediately for a Technical Reporting Engineer\n\n**Job Description**\n\n*   Design and develop custom worksheets, reports, and workflows using JavaScript and XML, with guidance from the Team.\n*   Troubleshoot and resolve technical issues in applications, including configuration and deployment support.\n*   Collaborate with cross-functional teams to translate business needs into data-driven solutions.\n*   Learn and adapt to SpectraQEST and other enterprise systems (training provided).\n*   Contribute to projects that integrate with wider infrastructure (networks, OS, etc.)\n*   Receive mentorship to expand your skills in database design, SQL scripting, and future full stack development.\n\n**Qualifications**\n\n*   Degree in Computer Science, IT, or related field or equivalent hands-on experience (e.g., coding bootcamps, personal projects).\n*   1+ years of hands-on experience with JavaScript and XML\n*   Basic understanding of SQL (querying, data extraction) and relational databases\n*   Strong logical reasoning and ability to translate requirements into functional code.\n*   Exposure to backend development or data-driven applications is an advantage\n*   Familiarity with network/infrastructure basics (OS, APIs, etc.) is an advantage\n*   Eagerness to learn enterprise systems like SpectraQEST (no prior experience needed)\n*   Problem-solving mindset with a focus on teamwork and collaboration.\n*   Ability to work independently on tasks while staying aligned with team goals.\n\n**Additional Information**\n\n*   Attractive salary and bonus with annual revision\n*   Compulsory insurance pay as gross monthly salary\n*   Flexible working time with 12 annual leave days & 15 work from home days\n*   Team-building activities, Sport Clubs\n*   Cooperation with colleagues around the world in a leading global group\n*   Strong team spirit in an entrepreneurial environment of a growing company\n*   People values, social responsibility and sustainability\n*   Opportunities for self-development and career advancement\n*   Internal training courses (technical, foreign language, soft skill)"
},
{
    "title": "HTML/CSS Developer",
    "company": "Firstsource",
    "location": "Vietnam",
    "date_posted": "2025-05-07",
    "job_url": "https://vn.linkedin.com/jobs/view/html-css-developer-at-firstsource-4222822738?position=10&pageNum=0&refId=yEZjo%2BIez2aR1YOZPIU%2BxQ%3D%3D&trackingId=ArUI33cpBEX8SLeET3ejCQ%3D%3D",
    "company_logo": null,
    "job_type": "Part-time",
    "job_level": null,
    "competencies": {
        "programming_languages": [
            "HTML",
            "CSS"
        ],
        "frameworks": [
            "Bootstrap"
        ],
        "platforms": [],
        "tools": [],
        "knowledge": [
            "web accessibility standards",
            "cross-browser compatibility"
        ],
        "soft_skills": [],
        "certifications": []
    },
    "company_addresses": null,
    "company_description": "Firstsource Solutions Limited\nis a prominent global business process management (BPM) company headquartered in Mumbai, India. Established in 2001 as ICICI InfoTech Upstream Ltd, it was rebranded to Firstsource Solutions Limited in 2006.",
    "description": "Firstsource Solutions Limited is a prominent global business process management (BPM) company headquartered in Mumbai, India. Established in 2001 as ICICI InfoTech Upstream Ltd, it was rebranded to Firstsource Solutions Limited in 2006.\n\nWe are seeking skilled HTML/CSS Developers with a minimum of 1 year of development experience to join us as freelancers and contribute to impactful projects.\n\n**Key Responsibilities:**\n\n*   Write clean, efficient code for data processing and transformation.\n*   Debug and resolve technical issues.\n*   Evaluate and review code to ensure quality and compliance\n\n**Required Qualifications:**\n\n*   1+ year of HTML/CSS development experience.\n*   Should have expertise in crafting responsive and visually appealing web pages using HTML5, CSS3, and frameworks like Bootstrap.\n*   Should understand cross-browser compatibility, web accessibility standards\n\n**Why Join Us?**\n\n*   Competitive pay (₹1000/hour).\n*   Flexible hours.\n*   Remote opportunity\n\n⚠️ **Disclaimer:**\n\nFirstsource follows a fair, transparent, and merit-based hiring process. We never ask for money at any stage. Beware of fraudulent offers and always verify through our official channels or @firstsource.com email addresses."
},
{
    "title": "Frontend Developer",
    "company": "NMS",
    "location": "Hanoi, Vietnam",
    "date_posted": "2025-05-04",
    "job_url": "https://vn.linkedin.com/jobs/view/frontend-developer-at-nms-4207846219?position=5&pageNum=0&refId=yEZjo%2BIez2aR1YOZPIU%2BxQ%3D%3D&trackingId=zncQWbyiyypnVCDGVOcoBw%3D%3D",
    "company_logo": null,
    "job_type": "Full-time",
    "job_level": "Entry-level",
    "competencies": {
        "programming_languages": [
            "HTML",
            "CSS",
            "Javascript",
            "Python"
        ],
        "frameworks": [
            "Angular",
            "Flask"
        ],
        "platforms": [],
        "tools": [
            "Docker",
            "Elaticsearch",
            "MongoDB"
        ],
        "knowledge": [],
        "soft_skills": [],
        "certifications": []
    },
    "company_addresses": null,
    "company_description": null,
    "description": "**JOB DESCRIPTION**\n\n*   Analyze requirements, design, and develop large, complex websites that cater to hundreds of thousands of users.\n*   Work on multiple new projects and tasks.\n*   Working hours: 9:00 AM – 6:30 PM, with a 1.5-hour lunch break, from Monday to Friday and the first Saturday of the month.\n\n**REQUIREMENTS**\n\n*   Good analytical and quick technology adaptation skills.\n*   Good web frontend programming skills: HTML, CSS, Javascript, and experience using one of the following web technologies: Angular.\n*   At least 1 year of practical product development experience.\n*   Preference will be given to candidates with the following (not all required):\n    *   Ability to analyze and design, and experience using the tech stack: Python, Flask, Elasticsearch, MongoDB, Docker.\n\n**BENEFITS**\n\n*   Attractive income of 15-20M/month.\n*   13th-month salary, annual salary review based on job performance.\n*   Modern, friendly working environment with many opportunities for personal development.\n*   Bonuses for holidays, Tet, and projects.\n*   “NMS care” insurance exclusively for NMS employees.\n*   Company-sponsored vacation (in May-June each year).\n*   Opportunity to be considered for salary increases twice a year, depending on job performance.\n*   Labor policies in accordance with the “Labor Code” in Vietnam."
},
{
    "title": "PHP Developer",
    "company": "Kasatria Technologies",
    "location": "Ho Chi Minh City, Vietnam",
    "date_posted": "2024-08-04",
    "job_url": "https://vn.linkedin.com/jobs/view/php-developer-at-kasatria-technologies-3984641923?position=9&pageNum=1&refId=82A%2BRMx58uSCqbk%2Bsf3BZw%3D%3D&trackingId=p8mVoJdeuAFxAnEKGB3PEw%3D%3D",
    "company_logo": null,
    "job_type": "Full-time",
    "job_level": "Entry-level",
    "competencies": {
        "programming_languages": [
            "PHP"
        ],
        "frameworks": [],
        "platforms": [],
        "tools": [],
        "knowledge": [],
        "soft_skills": [],
        "certifications": []
    },
    "company_addresses": null,
    "company_description": null,
    "description": "Mô tả công việc\n\n*   Development & maintenance of web applications\n*   Custom application, or new module, specifications\n*   Familiar Open Source/ Close source application, CMS, Framework\n*   Determining any functionality that the site must support and developing PHP content based on practical approved layout\n*   Test compatible with popular browsers\n*   Work closely with Product Manager, developers lead, designers to fully comprehend requirements of various products\n*   Be willing to go onsite if needed.\n\nĐại học\n\n**Job Description:**\n\n*   Development & maintenance of web applications\n*   Custom application, or new module, specifications\n*   Familiar with Open Source/ Close source applications, CMS, Frameworks\n*   Determining the functionality that the site must support and developing PHP content based on a practical approved layout\n*   Testing for compatibility with popular browsers\n*   Working closely with Product Managers, development leads, and designers to fully comprehend the requirements of various products\n*   Willing to work onsite if needed.\n\nUniversity degree"
},
{
    "title": "Software Engineer - Backend",
    "company": "ShopBack",
    "location": "Ho Chi Minh City Metropolitan Area",
    "date_posted": "2025-05-21",
    "job_url": "https://vn.linkedin.com/jobs/view/software-engineer-backend-at-shopback-3736620184?position=5&pageNum=1&refId=82A%2BRMx58uSCqbk%2Bsf3BZw%3D%3D&trackingId=ndao7l5XeShpHNE%2B%2FFHPoA%3D%3D",
    "company_logo": null,
    "job_type": "Full-time",
    "job_level": "Entry-level",
    "competencies": {
        "programming_languages": [
            "Node.js",
            "TypeScript"
        ],
        "frameworks": [],
        "platforms": [
            "AWS"
        ],
        "tools": [
            "Git",
            "Docker",
            "Jenkins",
            "Kubernetes",
            "Terraform",
            "CI/CD"
        ],
        "knowledge": [
            "Algorithms",
            "Data Structures",
            "Networking",
            "Security",
            "API Design",
            "Distributed Systems"
        ],
        "soft_skills": [
            "Teamwork",
            "Communication",
            "Mentoring",
            "Problem-solving",
            "Adaptability",
            "Flexibility"
        ],
        "certifications": []
    },
    "company_addresses": null,
    "company_description": null,
    "description": "## Our Journey\n\nShopBack started as a spark of inspiration one night in 2014 when Henry and Joel were brainstorming ideas in Henry’s car. That lightbulb moment — earning Cashback while shopping online — was just the beginning. Fueled by the countless possibilities, the team locked themselves in a hotel room for 24 hours to code the very first prototype. Their mission? To revolutionize shopping by helping advertisers market more cost-effectively, while making every purchase more rewarding for shoppers.\n\nToday, ShopBack is the leading shopping, rewards, and payments platform in Asia-Pacific, empowering 45 million shoppers across 12 markets. With 20,000+ partners and over half a million transactions daily, we’re redefining the way the world shops. As we expand globally, we’re looking for adventurous, driven individuals to help us build\n\nThe World’s Most Rewarding Way to Shop\n.\n\n## About The Role\n\nWe are seeking team members who strive to solve hard problems, take pride in delivering world-class products, and are strong team players.\n\nYou are someone who wants to see the impact of your work making a difference every day. You find passion in the craft and are constantly seeking improvement and better ways to solve tough problems.\n\n## Your Adventure Ahead\n\n*   Contribute to the ideation, technical design, implementation, and testing of product features that empower our business and deliver impact to our customers.\n*   Produce high-quality software following good architecture and design principles that are scalable.\n*   Design & deliver thoughtfully crafted APIs to drive the interactions between our client applications and backend services.\n*   Collaborate with the team to define the future of the ShopBack experience. Strong mentoring skills with the ability to provide technical guidance and review code.\n\n## Essentials To Succeed\n\n*   2+ years of experience developing consumer-facing web applications or complex distributed systems.\n*   Proven experience designing complex distributed systems, management products, or business applications. Understanding of good software design principles and have applied principles to professional work.\n*   Hands-on experience working with Node.js (Preferred).\n*   Have experience in TypeScript (Preferred).\n*   Have knowledge in Test Driven Development (TDD), CI/CD.\n*   Experience building and deploying applications and services into cloud environments (AWS highly desired).\n*   Strong experience in the design and implementation of robust and highly scalable web services.\n*   Ability to work effectively in a fast-paced, complex technical environment with high adaptability and flexibility.\n\n## ShopBackers DNA\n\n*   **Grit** - We tackle all challenges head-on, working together to solve problems and achieve success.\n*   **Hunger** - We value hard work, and having relentless drive.\n*   **Speed** - We move fast and have a bias for action, all to deliver maximum impact.\n*   **Impact** - We focus on results, always aiming for the best possible outcomes and timelines.\n*   **Growth** - We embrace a growth mindset, constantly striving to learn, improve, and excel in our roles.\n\n## Exclusively for ShopBackers\n\n*   Career progression paths and opportunities to take on greater challenges that help you realise your ambitions.\n*   Be part of a winning team on a journey to global scale.\n*   Competitive compensation based on your performance.\n*   Candid, open, and collaborative culture where feedback is valued, for everyone to grow and improve every day.\n*   Work-From-Anywhere benefit to enable you to thrive personally and professionally.\n\nShopBack is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. We do not discriminate on the basis of race, color, religion, sexual orientation, national origin, age, disability, genetic information, veteran status, or any other protected status under applicable laws. Join our team and help us make a difference!\n\nWe are committed to protecting your data and ensuring fairness in our recruitment process. As part of this process, we use AI tools to assist with tasks such as application screening and candidate matching. These tools are designed to enhance efficiency and reduce bias, and their use complies with applicable data protection laws and our commitment to fair employment practices. Your personal data will be processed securely and transparently, and final hiring decisions are always made by our recruitment team, not by automated systems. If you have any questions about how your data is used, or wish to exercise any of your rights including the right to such processing, please contact us at dpo@shopback.com."
},
{
    "title": "Fresher Java Software Engineer",
    "company": "KMS Technology, Inc.",
    "location": "Ho Chi Minh City, Vietnam",
    "date_posted": "2025-05-04",
    "job_url": "https://vn.linkedin.com/jobs/view/fresher-java-software-engineer-at-kms-technology-inc-4214758099?position=2&pageNum=1&refId=82A%2BRMx58uSCqbk%2Bsf3BZw%3D%3D&trackingId=nRspkz%2F6TknPljugUBv4Iw%3D%3D",
    "company_logo": null,
    "job_type": "Full-time",
    "job_level": "Entry-level",
    "competencies": {
        "programming_languages": [
            "Java"
        ],
        "frameworks": [
            "Spring",
            "J2EE"
        ],
        "platforms": [],
        "tools": [],
        "knowledge": [
            "Object-oriented design principles",
            "Design patterns"
        ],
        "soft_skills": [
            "Communication",
            "Problem-solving",
            "Teamwork"
        ],
        "certifications": []
    },
    "company_addresses": null,
    "company_description": "KMS Technology\nwas established in 2009 as a U.S.-based software services company. With development centers in Vietnam and Mexico, we have been trusted globally for the superlative quality of our software consulting & development services, technology solutions, and engineers expertise.We pride ourselves on creating brilliant solutions for our clients by leveraging deep expertise, advanced technologies, and delivery excellence for a shared success where everyone can reach their fullest potential. With three Business Lines:\nKMS Software:Leverage software domain expertise to help clients make better business decisions in technology platforms, increase speed-to-market, and gain critical development support through innovative technology solutions.\nKMS Solutions:Empower BFSI businesses to embrace the digital finance revolution and expedite clients’ journey towards complete digitalization, technology consulting, data analytics, software development, and software quality.\nKMS Healthcare:Build transformative next-gen technologies to solve healthcare’s most challenging problems, providing innovative tools and expertise to providers, payers, life sciences, and medical technology vendors.",
    "description": "**Your key responsibilities:**\n\n*   Participate in all software development activities following Scrum process\n*   Design solutions and approaches for software features or subsystems\n*   Write high-quality code to implement software features or fix bugs\n*   Perform unit testing, documentation and all other activities defined in Definition of Done before passing source code to Testing team\n*   Communicate and report internally or directly to client on status or result of work\n\n**Qualifications**\n\n**Your key qualifications:**\n\n**General requirements:**\n\n*   4th-year student or recent graduate with a Bachelors degree in Information Technology, Computer Science, Software Engineering, or a related field, with less than one (01) year of experience.\n*   Strong IT background with a GPA of 7.5+ (Please attach transcripts when submitting your CV).\n*   Upper-intermediate or higher English proficiency (both written and verbal).\n*   Minimum 3-month internship experience in software engineering is a plus.\n*   Strong self-learning ability with a proactive, growth-oriented mindset.\n*   Excellent analytical and problem-solving skills.\n*   Ability to work independently and collaborate effectively in a team.\n\n**Technical requirements:**\n\n*   Strong passion for Java technology and software development\n*   Solid understanding of Java and J2EE technologies for building web-based applications\n*   Good grasp of object-oriented design principles and design patterns\n*   Familiar with academic or internship projects, with a clear understanding of their architecture, implementation, and objectives\n\n**Perks Youll Enjoy**\n\n*   Working in one of the Best Places to Work in Vietnam\n*   Building large-scale & global software products\n*   Working & growing with Passionate & Talented Team\n*   Diverse careers opportunities with Software Outsourcing, Software Product Development, IT Solutions & Consulting\n*   Attractive Salary and Benefits\n*   Two performance appraisals every year and performance bonus\n*   Onsite opportunities: short-term and long-term assignments in North American (U.S, Canada), Europe, Asia.\n*   Flexible working time\n*   Various training on hot-trend technologies, best practices and soft skills\n*   Premium healthcare insurance for you and your loved ones\n*   Company trip, big annual year-end party every year, team building, etc.\n*   Fitness & sport activities: football, tennis, table-tennis, badminton, yoga, swimming…\n*   Joining community development activities: 1% Pledge, charity every quarter, blood donation, public seminars, career orientation talks,…\n*   Free in-house entertainment facilities (foosball, ping pong, gym…), coffee, and snack (instant noodles, cookies, candies…)\n*   And much more, join us and let yourself explore other fantastic things!"
},
{
    "title": "Java Developer Junior",
    "company": "NMS",
    "location": "Hanoi, Vietnam",
    "date_posted": "2025-05-04",
    "job_url": "https://vn.linkedin.com/jobs/view/java-developer-junior-at-nms-4207839960?position=4&pageNum=1&refId=82A%2BRMx58uSCqbk%2Bsf3BZw%3D%3D&trackingId=HG15SnL913agDDjvEFPJsg%3D%3D",
    "company_logo": null,
    "job_type": "Full-time",
    "job_level": "Entry-level",
    "competencies": {
        "programming_languages": [
            "Java"
        ],
        "frameworks": [
            "Angular",
            "Spring Boot",
            "Hibernate",
            "MyBatis",
            "JPA"
        ],
        "platforms": [],
        "tools": [
            "Intellij",
            "SQL developer",
            "PLSQL",
            "Git",
            "Elastic search",
            "Redis",
            "Docker"
        ],
        "knowledge": [],
        "soft_skills": [],
        "certifications": []
    },
    "company_addresses": null,
    "company_description": null,
    "description": "**JOB DESCRIPTION**\n\n*   Perform tasks as required by the Head of Department.\n*   Participate in software projects of the company & partners\n*   Implement programming tasks according to the assigned plan and ensure completion on schedule and quality requirements\n*   Working time: Mon - Fri, from 8:30 - 17:30\n\n**REQUIREMENTS**\n\n*   Professional requirements: proficient in Java programming language\n*   Programming skills requirements, able to use one of the following platforms:\n    *   Frontend: Angular 6+\n    *   Backend: One of the following Java-based frameworks: Spring Boot, Hibernate/MyBatis, JPA..\n    *   DB: MySQL/Oracle\n*   Proficient in using tools: Intellij, SQL developer/ PLSQL, Git\n*   Knowledge or experience with Elastic search, Redis is an advantage\n*   Knowledge or experience with Docker is an advantage\n*   Experience: minimum 1 year of programming the above platforms\n\n**BENEFITS**\n\n*   Competitive income 12 - 20M, deal according to ability\n*   13th month salary, Salary review 2 times/year depending on work results.\n*   Bonus for holidays, Tet, project bonus\n*   Entitled to 12 days of leave/year according to state regulations\n*   “NMS care” insurance exclusively for NMS employees.\n*   Vacation: According to company policy (May/June annually)\n*   Modern, friendly working environment with many opportunities for personal development.\n*   Policies for employees comply with the “Labor Code” in Vietnam."
},
{
    "title": "Software Developer",
    "company": "SUNJIN VIỆT NAM",
    "location": "Can Tho, Can Tho, Vietnam",
    "date_posted": "2025-02-04",
    "job_url": "https://vn.linkedin.com/jobs/view/software-developer-at-sunjin-vi%E1%BB%87t-nam-4125924507?position=10&pageNum=2&refId=5AD%2F4nBmohLvaXphH1IzRw%3D%3D&trackingId=SGR%2FyHLO6KRxwLg%2BeCrD8A%3D%3D",
    "company_logo": null,
    "job_type": "Full-time",
    "job_level": "Entry-level",
    "competencies": {
        "programming_languages": [
            "JAVA",
            "JavaScript"
        ],
        "frameworks": [
            "Spring Framework",
            "JSP"
        ],
        "platforms": [
            "Windows",
            "Linux"
        ],
        "tools": [
            "Git"
        ],
        "knowledge": [
            "RDBMS",
            "ORACLE",
            "MS-SQL",
            "Rest APIs"
        ],
        "soft_skills": [
            "Communication",
            "Problem-solving"
        ],
        "certifications": []
    },
    "company_addresses": "Floor 12A, Sofic Tower, 10 Mai Chi Tho, Thu Thiem Ward, District 2, Ho Chi Minh City, Vietnam",
    "company_description": null,
    "description": "**Số lượng:** 1 người\n\n**Kinh nghiệm:** 2 - 3 năm\n\n**Bằng cấp:** Cao Đẳng, Đại Học\n\n**Cấp bậc:** Nhân viên\n\n**Nơi làm việc:** Tp. HCM\n\n**Thu nhập/ tháng:** 20 - 25 Triệu\n\n**Job Descriptions**\n\nThis role involves two main tasks: software development and user support. In software development, youll create and maintain web/mobile applications, including work on Sunjins system. For user support, youll assist end-users with program issues and provide documentation and training to end-user for smooth operation.\n\n**Software development**\n\n*   Incharge for developing and maintaining the SFA (Sales Force Automation) system.\n*   Involved in developing Sunjin’s systems, such as HRM, SAP, and others.\n*   Works with internal Business Analysts and key Users to develop softwares/solutions to fulfill business needs.\n*   Apply new technologies and frameworks to develop flexible solutions that are suitable for the companys business.\n\n**User support:**\n\n*   Be the first-point contact for troubleshooting, and resolve issues/challenges related to business applications from users within the company.\n\n**Company main business applications:**\n\n*   ERP (SAP B1), SFA, HRM, GOOGLE WORKPLACE\n\n**Job Requirements**\n\n*   Bachelor’s Degree in computer science, engineering, or relevant field.\n*   At least 2 years of JAVA development experience. Experience in operating CRM/SFA is preferred:\n*   Spring Framework, JSP, JavaScript, RDBMS (ORACLE, MS-SQL)\n*   Ability to set up and WebSphere Application Server (Tomcat)\n*   Ability to understand and develop Rest APIs\n*   Have knowledge about Windows, Linux\n*   Can understand English documents and make reports by English\n*   Preference will be given to candidates working in internal companies\n\n**WORKPLACE & WORK TIME**\n\n*   Workplace: Floor 12A, Sofic Tower, 10 Mai Chi Tho, Thu Thiem Ward, District 2, Ho Chi Minh City, Vietnam\n*   Work time: 7:30 - 16:30 (Monday - Saturday), off 2 Saturdays a month\n\n**Compensation & Benefits**\n\n*   Pay social insurance on total salary\n*   24/24 accident insurance for employees\n*   Leave, holidays and company establishment date according to regulations\n*   Provide breakfast and lunch at factories\n*   Give birthday gifts and holiday gifts throughout the year\n*   Annual travel\n*   Internal and external training\n*   13th month bonus + productivity bonus based on business performance\n*   Training program based on seniority\n*   Foreign language allowance\n*   Paid leave on the day the company is established\n*   Support for shuttle and business vehicles outside the market\n*   Phone, laptop, car support (according to company regulations)\n\n**Liên hệ**\n\nỨng viên quan tâm vui lòng gửi CV/ Resume theo địa chỉ mail:\n\nSunjinsouth@sj.co.kr\n\nMọi thắc mắc cần được giải đáp xin vui lòng gọi\n\nMr. Duc: 0337.416.150\n\nMs. Mai: 0396.764.259\n\nMs. Vũ: 0935.056.658"
},
{
    "title": "Frontend Developer (all genders)",
    "company": "HRS Group",
    "location": "Ho Chi Minh City, Vietnam",
    "date_posted": "2025-05-14",
    "job_url": "https://vn.linkedin.com/jobs/view/frontend-developer-all-genders-at-hrs-group-4173945297?position=9&pageNum=2&refId=5AD%2F4nBmohLvaXphH1IzRw%3D%3D&trackingId=QpwgVQDriSH3327ehvelOw%3D%3D",
    "company_logo": null,
    "job_type": "Full-time",
    "job_level": "Mid-Senior level",
    "competencies": {
        "programming_languages": [
            "JavaScript",
            "Typescript",
            "HTML",
            "CSS"
        ],
        "frameworks": [
            "React",
            "ReactJS"
        ],
        "platforms": [
            "AWS",
            "AWS Amplify"
        ],
        "tools": [
            "Git",
            "Figma"
        ],
        "knowledge": [
            "SCRUM",
            "Agile",
            "UI/UX Design"
        ],
        "soft_skills": [
            "Communication"
        ],
        "certifications": []
    },
    "company_addresses": null,
    "company_description": null,
    "description": "Hrs As a Company\n\nHRS, a pioneer in business travel, aims to elevate every stay through innovative technology. With over 50 years of experience, their digital platform, driven by ProcureTech, TravelTech, and FinTech, transforms how companies and travelers Stay, Work, and Pay.\n\nProcureTech digitally revolutionizes lodging procurement, connecting corporations and suppliers in a cutting-edge ecosystem. This enables seamless efficiency and automation, surpassing travelers expectations.\n\nTravelTech redefines the online lodging experience, offering personalized content from selection to check-in, ensuring an unparalleled journey for corporate travelers.\n\nIn FinTech, HRS introduces advancements like mobile banking and digital payments, turning corporate back offices into touchless lodging enablers, eliminating legacy cost barriers. The innovative 2-click book-to-pay feature streamlines interactions for travelers and hoteliers.\n\nCombining these technology propositions, HRS unlocks exponential catalyst effects. Their data-driven focus delivers value-added services and high-return network effects, creating substantial customer value.\n\nHRSs exponential growth since 1972 serves over 35% of the global Fortune 500 and leading hotel chains.\n\nJoin HRS to shape the future of business travel, empowered by a culture of growth and setting new industry standards worldwide.\n\nBUSINESS UNIT\n\nTravelTech enables travelers to search and book hotel and meeting room content via modern SAAS booking portals and APIs. Our mission is to provide high quality content and an outstanding user experience to the traveler on the one side and compliance and cost savings for the cooperate travel programs on the other side.\n\nPOSITION\n\nWe are looking for a Frontend Engineer React (all genders) who loves to build top notch SAAS application delivering an outstanding user experience for Travelers, Meeting Planners and Hotel Partners.\n\nCHALLENGE\n\n*   Implement applications in JavaScript/Typescript (React)\n*   Ensure quality of code is kept on a high level\n*   Develop, implement and improve application architecture based on AWS Cloud\n*   Support the Product Owner , Product Manager , and UX Designer with requirement engineering\n*   Collaborate across teams with regards to overarching technical concepts and practices\n*   Stabilize, perform improvement and refactor service layer and data model\n\nYou work on one of our core systems and implement our extranet application, used by thousands of clients to create and manage their assets, content and data.\n\nFOR THIS EXCITING MISSION YOU ARE EQUIPPED WITH...\n\n*   Strong experience in JavaScript/Typescript, HTML/CSS, ReactJS\n*   Proficient in building and maintaining dynamic and interactive frontend elements\n*   Willingness to contribute to UI design improvements with attention to detail\n*   Nice to know about deploying applications at scale with techniques like Infrastructure as Code, Canary or Blue­ Green Deployments\n*   Utilize AI tools to increase development productivity and quality\n*   Nice to know about AWS Amplify for building and deploying frontend applications\n*   Good knowledge of flexible layout, making mobile terminal responsive layout, and solving screen adaptation problems\n*   Good understanding of SCRUM/Agile methodologies\n*   UI/UX Design experience with Figma or similar tools is a plus\n*   Fluency in English, spoken and written.\n\nPERSPECTIVE\n\nAccess to a global network of a globally united and mutually responsible \"Tribe of lntrapreneurs\" that is passionately dedicated to renew the travel industry and while doing so reinvent the ways how businesses stay, work and pay .\n\nOur entrepreneurial driven environment of full ownership and execution focus offers you the playground to contribute to a greater mission, while growing personally and professionally throughout this unique journey. You will continuously learn from a radical culture of retrospectives and continuous improvement and actively contribute to making business life better, smarter and more sustainable.\n\nLOCATION, MOBILITY, INCENTIVE\n\nThe attractive remuneration is in line with the market and, in addition to a fixed monthly salary, all necessary work equipment and mobility, will also include an annual or multi-year bonus."
},
{
    "title": "Software Engineer (Front-End)",
    "company": "Hubble.Build",
    "location": "Ho Chi Minh City, Ho Chi Minh City, Vietnam",
    "date_posted": "2025-05-07",
    "job_url": "https://vn.linkedin.com/jobs/view/software-engineer-front-end-at-hubble-build-4222070342?position=4&pageNum=2&refId=5AD%2F4nBmohLvaXphH1IzRw%3D%3D&trackingId=Gekp71069Qm9zC3DgVpdcw%3D%3D",
    "company_logo": null,
    "job_type": "Full-time",
    "job_level": "Mid-level",
    "competencies": {
        "programming_languages": [],
        "frameworks": [
            "ReactJS"
        ],
        "platforms": [],
        "tools": [],
        "knowledge": [
            "web application architecture",
            "software engineering design patterns"
        ],
        "soft_skills": [],
        "certifications": []
    },
    "company_addresses": null,
    "company_description": null,
    "description": "What You Will Be Doing\n\n*   Developing a clean and maintainable code using software engineering best-practices and modern platforms.\n*   Participating in full product development lifecycles from ideation to live production.\n*   Day-to-day tech operations such as server maintenance and deployment.\n\nWhat We Need From You\n\n*   Minimum 1 years of software engineering experience building Web Front End Applications.\n*   Comfortable using English in a professional setting.\n*   Experience working on ReactJS applications.\n*   Have a good understanding of web application architecture\n*   Have a good understanding of various software engineering design patterns\n*   Versatility and enthusiasm to tackle new problems across the full-stack and to learn new frameworks as we continue to push technology forward"
},
{
    "title": "[HN] Software Engineer (Full-stack,Junior)",
    "company": "Base Careers",
    "location": "Hanoi, Vietnam",
    "date_posted": "2025-04-04",
    "job_url": "https://vn.linkedin.com/jobs/view/hn-software-engineer-full-stack-junior-at-base-careers-4181754825?position=1&pageNum=2&refId=5AD%2F4nBmohLvaXphH1IzRw%3D%3D&trackingId=XGVH9rfmmsc3oTvL6BpA7g%3D%3D",
    "company_logo": null,
    "job_type": "Full-time",
    "job_level": "Junior",
    "competencies": {
        "programming_languages": [
            "PHP",
            "Javascript"
        ],
        "frameworks": [
            "jQuery"
        ],
        "platforms": [],
        "tools": [
            "Git"
        ],
        "knowledge": [
            "Algorithms",
            "Data structures",
            "Restful API",
            "MySQL",
            "HTML5",
            "CSS3",
            "AJAX",
            "JSON",
            "performance optimization"
        ],
        "soft_skills": [],
        "certifications": []
    },
    "company_addresses": "16th floor, HUD Building, 37 Le Van Luong, Thanh Xuan, Hanoi.",
    "company_description": "Base.vn is a B2B SaaS (Software-as-a-Service) Company providing technology management solutions for SMEs enterprises.\nBase will bring to your business the smartest, most modern technology products, based on three main components: Data & Artificial Intelligence (Data & AI), Interaction (Interaction), and Platform platform (Open Platform). And imagination knows no bounds: With whatever application you have or need, Base can help you integrate into a common platform. With a strong belief in young Vietnamese engineers, we are looking for talented\nSoftware Engineer\nfor the Platform Team to pursue Base’s mission together: Build great enterprise software for Asia.",
    "description": "## About Us\n\nBase.vn is a B2B SaaS (Software-as-a-Service) Company providing technology management solutions for SMEs enterprises.\n\nBase will bring to your business the smartest, most modern technology products, based on three main components: Data & Artificial Intelligence (Data & AI), Interaction (Interaction), and Platform platform (Open Platform). And imagination knows no bounds: With whatever application you have or need, Base can help you integrate into a common platform. With a strong belief in young Vietnamese engineers, we are looking for talented Software Engineer for the Platform Team to pursue Base’s mission together: Build great enterprise software for Asia.\n\n## What You Do\n\nFrom the beginning, you will be guided by Senior Engineer or Team Lead to:\n\n*   Understand the products we‘re passionately building and know what to improve yourself to build them better in the future\n*   Understand and respect all the working principles\n*   Efficiently work with all the materials\n*   Get your very first products - “Starter Project\" done, reviewed, and improved\n\nThen, you will join a **full-cycle** buildup apps/features in our platform:\n\n*   Analyze product & Planning\n*   Design Database\n*   Develop & Test\n*   Demo & Launch\n*   Maintain & Update new features\n\n## Who You Are\n\nWe‘re looking for talented Software Engineers (Junior) to join our team with below traits:\n\n*   Solid knowledge in Algorithms & Data structures\n*   Strong knowledge and experience in using any programming language (PHP/Javascript is an advantage)\n*   Knowledge or experience in using Restful API, MySQL, HTML5, CSS3, Javascript, jQuery, AJAX, JSON\n*   Understanding of performance optimization or experience in real applications in production, serving large amounts of users and data - is an advantage\n*   Desire to participate in building the product \"B2B SaaS - Make in Vietnam\"\n\n## Special Benefits\n\n### WHAT YOU CAN GET\n\n*   Attractive salary package up to 1600$ plus bonus based on performance\n*   Flexible evaluation of salary increase (1-2 times/year) commensurate with work results\n*   Opportunity to receive ESOP shares (employee stock ownership plan) for outstanding contributors\n*   High performance computer and screen\n*   Team building, vacation in a year, and other engagement activities\n*   Other benefits as prescribed by the Labor Law\n\n### Personal Development\n\n*   Fast-track career: Join a full cycle of building real products for market and continuously grow with the scalability of products.\n*   Unlimited learning opportunities: Enhance your expertise through a comprehensive training program, guidelines from mentors, buddies, and product development challenges.\n*   Visible values & impacts: Build world-class and high-performance products that solve pain points for millions of enterprises.\n*   Talented colleagues: Work with a team of enthusiastic and professional Product Builders who have already built a highly large-scale system serving 60+ millions of pageviews, hundreds of thousands users each month, and 10,000+ enterprises; and graduated from top universities in Vietnam & the world (Stanford, UCLA, HUST, etc.).\n\n## GET READY TO BE OUR SOFTWARE ENGINEER!\n\n*   Round 1: CV Application\n*   Round 2: Interview\n\nAddress Office: 16th floor, HUD Building, 37 Le Van Luong, Thanh Xuan, Hanoi."
},
{
    "title": "Junior Frontend (UI) Software Engineer (Internship)",
    "company": "TGM Research",
    "location": "Ho Chi Minh City, Vietnam",
    "date_posted": "2025-05-14",
    "job_url": "https://vn.linkedin.com/jobs/view/junior-frontend-ui-software-engineer-internship-at-tgm-research-4224493200?position=10&pageNum=3&refId=q4twalXJ2TgtbpyiJc9t0Q%3D%3D&trackingId=USKV2JHd1nmlgW7ecXfCTg%3D%3D",
    "company_logo": null,
    "job_type": "Internship",
    "job_level": "Junior",
    "competencies": {
        "programming_languages": [
            "JavaScript",
            "HTML",
            "CSS"
        ],
        "frameworks": [
            "React",
            "Angular",
            "Vue.js"
        ],
        "platforms": [],
        "tools": [
            "Git",
            "Chrome DevTools"
        ],
        "knowledge": [
            "UI/UX design principles",
            "SEO best practices",
            "web performance optimization techniques",
            "accessibility standards"
        ],
        "soft_skills": [
            "Communication",
            "Teamwork",
            "Problem-solving"
        ],
        "certifications": []
    },
    "company_addresses": null,
    "company_description": null,
    "description": "Location:\nHCMC, Vietnam\n\nAbout Us\nTGM Research is one of the fastest growing and most innovative market research companies, offering valuable insights to businesses across various industries. We are committed to delivering high-quality market research solutions to our clients by connecting them with the right participants through our online panels.\n\nIf you are proactive, curious, creative type of person, who is a great team player and doesn’t hesitate to take responsibility and lead an independent project, we invite you to join our team and help our clients succeed in their research endeavours!\n\nAbout The Role\nAs a Junior Frontend (UI) Software Engineer, you will be responsible for developing and maintaining user-facing features of web applications. You will work closely with UX/UI designers, backend developers, and other team members to translate design wireframes and prototypes into functional, responsive, and visually appealing web interfaces. This role is ideal for someone starting their career in frontend development who is eager to learn, collaborate, and grow their technical skills.\n\nWe offer a 6-month trainee contract, with the possibility of extending it to a professional contract upon positive feedback after the trainee period.\n\nWhat Youll Do\n\n*   Develop, test, and maintain responsive web pages and user interface components using HTML, CSS, and JavaScript.\n*   Collaborate with UX/UI designers to implement design concepts and ensure brand consistency.\n*   Work alongside backend developers to integrate frontend components with server-side logic.\n*   Optimize web applications for maximum speed and scalability across devices and browsers.\n*   Participate in debugging and fixing UI bugs and issues.\n*   Ensure cross-browser compatibility and mobile responsiveness.\n*   Write clean, maintainable, and reusable code following best practices.\n*   Assist in creating and maintaining documentation related to frontend development.\n*   Stay updated with emerging frontend technologies and industry trends.\n*   Participate in code reviews and team knowledge sharing sessions.\n\nWhat Were Looking For\n\n*   Proficiency in English - required\n*   Basic to intermediate proficiency in HTML5, CSS3, and JavaScript.\n*   Familiarity with frontend frameworks/libraries such as React, Angular, or Vue.js is a plus.\n*   Understanding of responsive and adaptive design principles.\n*   Ability to collaborate effectively with designers, backend developers, and other stakeholders.\n*   Strong problem-solving skills and attention to detail.\n*   Eagerness to learn new technologies and improve coding skills.\n*   Good communication skills and ability to work in a team environment.\n*   Experience with version control systems like Git is preferred.\n*   Exposure to debugging tools such as Chrome DevTools.\n\nNice To Have\n\n*   Knowledge of UI/UX design principles.\n*   Experience with accessibility standards and SEO best practices.\n*   Familiarity with Agile development methodologies.\n*   Basic understanding of web performance optimization techniques.\n*   Experience with content management systems and graphic design tools.\n\nWhat We Offer\n\n*   Competitive salary and performance-based bonuses, based on experience\n*   Professional development opportunities\n*   International Team setup\n*   Flexible Working Policy\n*   A collaborative and innovative work environment\n*   Working with the newest technologies and using modern tools\n\n#marketresearch #software #softwareengineer"
},
{
    "title": "Software Engineer",
    "company": "clearer.io",
    "location": "Ho Chi Minh City Metropolitan Area",
    "date_posted": "2025-05-04",
    "job_url": "https://vn.linkedin.com/jobs/view/software-engineer-at-clearer-io-4224180439?position=8&pageNum=2&refId=5AD%2F4nBmohLvaXphH1IzRw%3D%3D&trackingId=7M4aZ%2B92Yh%2B7CL0L2qMtiQ%3D%3D",
    "company_logo": null,
    "job_type": "Full-time",
    "job_level": "Entry-level",
    "competencies": {
        "programming_languages": [
            "Node.js",
            "Typescript",
            "PHP",
            "Python",
            "Go"
        ],
        "frameworks": [
            "React",
            "NextJS",
            "Angular",
            "Vue",
            "GraphQL",
            "ORM"
        ],
        "platforms": [],
        "tools": [
            "Git"
        ],
        "knowledge": [
            "OOP",
            "functional programming",
            "design patterns",
            "DRY",
            "SOLID",
            "IoC",
            "RESTful APIs",
            "database design",
            "optimization",
            "Agile methodologies"
        ],
        "soft_skills": [
            "Leadership",
            "Inquisitiveness",
            "Tenacity",
            "Teamwork",
            "Communication"
        ],
        "certifications": []
    },
    "company_addresses": null,
    "company_description": null,
    "description": "Take the clearer route to smart career growth. At clearer.io , we’re reimagining eCommerce by enhancing search, discovery, and customer engagement through a standout suite of innovative apps. Our mission is straightforward yet powerful: to empower our partners with solutions that streamline their operations, foster customer trust, and drive sustainable growth. We’re not just about technology - we’re about making eCommerce smarter, simpler, and more impactful, delivering solutions that inspire confidence and create real results.\n\nWith fresh investment and rapid growth, this is the perfect time to join our journey. When you become part of clearer.io, you step into a role where your work truly matters. Here, you’ll have the opportunity to own your projects, drive outcomes, and make an impact within a supportive, diverse team of professionals dedicated to customer success. We value clarity, results, and a customer-centric approach that keeps us focused on delivering real value to our partners every step of the way.\n\nIf you’re ready to cut through the clutter and focus on what really matters in a dynamic eCommerce landscape, clearer.io is the place to grow, lead, and shape the future of online retail. Join us, and be part of a team that’s committed to making eCommerce clearer, more efficient, and more rewarding for everyone.\n\n**Your Impact:**\nAs a Software Engineer I (This is a 1-year temporary position with the potential to become permanent based on performance and business needs), you will be a key contributor to the design, development, and deployment of features for our cloud-based SaaS platform. Youll take ownership of small to medium-sized projects, collaborate with cross-functional teams, and mentor junior engineers. This role provides opportunities for technical growth and increasing influence within the engineering team. You will join a fully remote engineering team based in Vietnam. This team emphasizes collaboration and technical excellence, fostering an environment where engineers are encouraged to contribute to the projects core foundation and features, advocating for best practices and latest, proven, cutting-edge technologies. The engineer will work directly with the Technical Lead of the Integrations team.\n\n**What you’ll do:**\n\n*   Design, develop, test, and maintain complex features for cloud-based SaaS applications using specified technologies\n*   Debug and resolve complex software defects and performance issues\n*   Lead the development of small to medium-sized features, taking ownership from design to deployment\n*   Write clean, well-documented, and testable code\n*   Proactively identify and address performance bottlenecks and scalability issues\n*   Participate in code reviews and provide constructive feedback to other engineers\n*   Contribute to the continuous improvement of development processes and tooling\n*   Mentor and guide junior engineers\n*   Collaborate with product managers to define and refine requirements\n*   Troubleshoot and resolve production issues\n\n**What You’ll Bring:**\n\n*   Bachelor’s degree in Computer Science, Engineering, or equivalent and 2-4 years of relevant experience is required. Alternatively, an equivalent combination of education and experience is required\n*   Experience with e-commerce and with specific experience of Shopify a plus!\n*   Strong expertise in programming principles (e.g. OOP, functional) and design patterns (e.g. DRY, SOLID, IoC)\n*   Strong proficiency in at least one frontend library or framework (React - preferred, NextJS, Angular, or Vue) and experience building complex UI components\n*   Strong proficiency in at least one backend language (Node.js/Typescript - preferred, PHP, Python, or Go) and experience building RESTful and GraphQL APIs\n*   Experience with database design, optimization, and ORM frameworks\n*   Strong understanding of Agile methodologies and experience leading small development teams\n*   Proficiency in prompt engineering and experience in using AI coding assistant tool in day-to-day work\n\n**Qualities:**\nWhat other characteristics do we look for? Leadership for sure. But what does that mean? Well, some of the attributes we appreciate include:\n\n*   Inquisitiveness\n*   Having pride in one’s work\n*   Tenacity: trying to work it out but knowing when to ask for help\n*   Follow-thru and dependability\n*   A strong belief in the team’s success\n*   Most importantly, friendly/kind/a good teammate\n*   Demonstrable examples of leading individuals/teams driving architectural direction, establishing best-practices and patterns\n\n**Why Clearer.io?**\n\n*   Customers at the heart: We make our customers the stars of our show and help them thrive. When they grow, so do we. We obsess over their needs so we can dream big on their behalf\n*   Purposeful progress: We harness our ingenuity to keep leveling up and growing stronger. We take initiative, think boldly, and don’t settle for the status quo. Every risk teaches us something new\n*   Endless innovation: We take action, refine our work, and drive meaningful growth for each other and our customers. Humble in our pursuit, we continuously seek to improve. We ask ‘How can we help?’ striving always to make a meaningful\n*   Always open: With transparency we simplify the complex, collaborate globally and empower everyone. We believe openness in our communication - with customers, partners, and team members - is essential for building strong relationships\n\n**Clear Benefits:**\n\n*   100% Remote Culture: Work from anywhere that brings you happiness\n*   Performance-based Year-End Bonus: Recognizing and rewarding your individual contributions\n*   Wellness Allowance: Support for classes promoting physical and mental health\n*   Time Off: 20 days/year, in addition to Vietnam holidays\n*   MacBook Provided\n*   Collaborative Events: Offline meet-ups, monthly gatherings, year-end party, and company trips\n*   Continuous Learning: Technical and general workshops, online resources\n*   Health and Wellness Benefits: Generali Health Care, annual check-up\n*   International Exposure: Enhance expertise and English communication skills\n\nBe a part of Clearer.io—where your expertise fuels real change in eCommerce. Come and join us- it’s clear we’re the place to be!"
},
{
    "title": "ReactJS Developer (Junior/Middle)",
    "company": "Saigon Technology - Accelerate Software Development",
    "location": "Da Nang, Da Nang City, Vietnam",
    "date_posted": "2025-05-28",
    "job_url": "https://vn.linkedin.com/jobs/view/reactjs-developer-junior-middle-at-saigon-technology-accelerate-software-development-4235946825?position=9&pageNum=3&refId=q4twalXJ2TgtbpyiJc9t0Q%3D%3D&trackingId=kXxxtcqrn0RheL3P860%2FTQ%3D%3D",
    "company_logo": null,
    "job_type": "Full-time",
    "job_level": "Entry-level",
    "competencies": {
        "programming_languages": [
            "JavaScript",
            "NodeJS"
        ],
        "frameworks": [
            "ReactJS",
            "Redux"
        ],
        "platforms": [],
        "tools": [
            "GIT"
        ],
        "knowledge": [],
        "soft_skills": [
            "Communication"
        ],
        "certifications": [
            "AWS",
            "Azure",
            "IELTS",
            "PMP",
            "Scrum Master"
        ]
    },
    "company_addresses": null,
    "company_description": null,
    "description": "## Job Description\n\n*   Develop UI Elements to integrate with server side logic\n*   Solve technical problems\n*   Support teammates to solve problems\n\n## Job Requirements\n\n**MUST HAVE SKILLS:**\n\n*   At least 2 years of experience in ReactJS, Redux. NodeJS is a plus\n*   Have good knowledge or experience in front-end technologies, such as HTML5, and CSS3\n*   Experience with GIT source control, Agile process\n*   MUST be good at English communication\n\n## Benefits\n\n*   Competitive Salary and Brilliant Health Benefits\n*   Attractive salary (13th-month salary, salary review twice/year) and project bonus\n*   Bonus programs for candidate referral, technical article writing\n*   Interest-free loan support for personal plan\n*   Allowance for sickness, maternity, paternity and periodic health examination\n*   PVI health care program\n*   The staff of the quarter and year reward\n\n## Progressive and Fun Working Environment\n\n*   A professional English-speaking working environment with Agile – Scrum model\n*   Hybrid Working Model: Flexible working time and WFH support.\n*   Surrounded with friendly, open-minded, young and supportive colleagues\n*   Annual company trip and regular team-building parties, party celebration (Christmas, Birthday, Mid-autumn,...), Sports clubs (football, badminton, swimming …)\n\n## Valuable Training\n\n*   Sponsor examination fee for professional certificates (AWS, Azure, IELTS, PMP, Scrum Master,...)\n*   Sponsor fee for joining any technical training sessions and courses.\n*   Free English workshops"
},
{
    "title": "MMORPG Game Developer (Fresher/Experienced)",
    "company": "Nexon Networks Vina",
    "location": "District 7, Ho Chi Minh City, Vietnam",
    "date_posted": "2025-05-04",
    "job_url": "https://vn.linkedin.com/jobs/view/mmorpg-game-developer-fresher-experienced-at-nexon-networks-vina-4215757067?position=8&pageNum=3&refId=q4twalXJ2TgtbpyiJc9t0Q%3D%3D&trackingId=LEI1h1mQ37okIgX9rJQfUg%3D%3D",
    "company_logo": null,
    "job_type": "Full-time",
    "job_level": "Entry-level",
    "competencies": {
        "programming_languages": [],
        "frameworks": [],
        "platforms": [
            "Linux"
        ],
        "tools": [],
        "knowledge": [
            "Object-oriented programming",
            "Multithreaded programming",
            "Network programming",
            "Database schema design",
            "Data structures",
            "Algorithms"
        ],
        "soft_skills": [
            "Communication",
            "Problem-solving"
        ],
        "certifications": []
    },
    "company_addresses": null,
    "company_description": null,
    "description": "**General Competencies**\n\n*   Passion and dedication to game development\n*   Positive attitude and proactive communication skills\n*   Strong sense of responsibility for assigned tasks\n*   Logical thinking and creative problem-solving abilities\n\n**Job-Specific Skills**\n\n*   Understanding and implementation of object-oriented programming\n*   Understanding and implementation of multithreaded programming\n*   Understanding and implementation of network programming\n*   Database schema design and procedure implementation skills\n*   Understanding and implementation of various data structures and algorithms\n\n**Preferred Qualifications**\n\n*   Experience in online game server development\n*   Experience using commercial server engines\n*   Experience in development within Linux environments"
},
{
    "title": "[HN] JUNIOR DEVELOPER (ANY LANGUAGES)",
    "company": "TEKY ACADEMY",
    "location": "Hanoi, Vietnam",
    "date_posted": "2025-02-04",
    "job_url": "https://vn.linkedin.com/jobs/view/hn-junior-developer-any-languages-at-teky-academy-4139341889?position=7&pageNum=2&refId=5AD%2F4nBmohLvaXphH1IzRw%3D%3D&trackingId=xKlggGGKLnkV8BG%2FTNQLNg%3D%3D",
    "company_logo": null,
    "job_type": "Full-time",
    "job_level": "Junior",
    "competencies": {
        "programming_languages": [
            "Python",
            "Ruby",
            "PHP"
        ],
        "frameworks": [
            "Django",
            "Ruby on Rails",
            "Node.js"
        ],
        "platforms": [],
        "tools": [],
        "knowledge": [
            "Algorithms",
            "Data Structures",
            "Database"
        ],
        "soft_skills": [
            "Problem-solving"
        ],
        "certifications": []
    },
    "company_addresses": "Số B-TT01-51-53 Khu nhà ở Ngân Hà Vạn Phúc, phường Vạn Phúc, quận Hà Đông, TP Hà Nội\nTầng 5, tòa MAC Plaza, số 10 Trần Phú, Hà Đông.",
    "company_description": null,
    "description": "Công nghệ\n\nFrom 01 year of experience\n\nContact for application at tuyendung@teky.edu.vn or 02471096668\n\nSalary: 12,000,000đ - 16,000,000đ/month\n\nApplication deadline: 30.06.2023\n\nDepartment: Technology\n\nWorking time: Fulltime\n\nArea: Hanoi\n\nQuantity: 1\n\nSend application\n\nJob information\n\nWorking time: 8h00 - 17h00, 1 hour lunch break. Working from Monday to Saturday morning every week\n\nWorking place:\n\nTeky Headquarters [Hanoi]: No. B-TT01-51-53 Ngan Ha Van Phuc Housing Area, Van Phuc Ward, Ha Dong District, Hanoi City\n\n**JOB DESCRIPTION**\n\nQuantity 02\n\n*   Design and program features for EdTech products using Python + Django/Ruby on Rails/PHP\n*   Write quality code: clear, easy to maintain, reusable\n*   Participate in the process of business analysis, design and development of features\n*   Continuously optimize products, handle errors and improve system stability and user experience\n*   Build common libraries and APIs for products\n*   Work with experienced programmers, managers, and designers to build products\n\nWorking location: 5th floor, MAC Plaza building, 10 Tran Phu, Ha Dong.\n\n**About the System and Technology team**\n\nAt TEKY, all online/offline activities from internal operations (sales, customer care, accounting, etc.) to learning management (schedule, review, homework, interaction with students/parents) all apply technology in a methodical and systematic way. , and is a mandatory criterion that every employee needs to master. The System and Technology Team are the people who build, develop and operate the systems; ensure that daily activities at TEKY take place most effectively, bringing the best experience to internal staff, parents and students.\n\n**JOB REQUIREMENTS**\n\n*   College/University or higher degree in Computer Science/Information Technology/Information Systems/Software Technology or similar majors\n*   Passionate about programming, creative and likes to solve challenging problems\n*   Have practical experience working with one of the popular Web frameworks: Django, Ruby on Rails, Node.js, PHP,…\n*   Have solid understanding of the basic knowledge of computer science: data structures, algorithms, databases\n*   Have practical experience working with data management systems: MySQL, PostgreSQL, MongoDB\n*   Logical problem-solving thinking\n*   Work experience from 1 year or more\n\n**BENEFITS**\n\n*   Salary and bonus based on capacity: 12 – 16 million/month, or can be negotiated based on capacity\n*   Working with the No. 1 team in Vietnam in the STEAM for K12 field: TEKY staff are the people who are creating and leading the STEAM trend for K12 in Vietnam\n*   CBNVs children are entitled to free technology courses.\n*   13th month salary; quarterly and annual business performance bonus; bonus for holidays and Tet according to company regulations\n*   Working in a dynamic, professional educational environment with modern facilities and rich social meaning.\n*   Enjoy full benefits according to state regulations (social insurance, health insurance, unemployment insurance,...)\n*   Travel at least once a year, continuously participate in Teambuilding\n*   Enjoy other benefits besides salary periodically or non-periodically\n\nSend application"
},
{
    "title": "Software Engineer Intern - React (6 months internship)",
    "company": "CODE LEAP",
    "location": "Ho Chi Minh City, Vietnam",
    "date_posted": "2025-05-30",
    "job_url": "https://vn.linkedin.com/jobs/view/software-engineer-intern-react-6-months-internship-at-code-leap-4236679144?position=7&pageNum=3&refId=q4twalXJ2TgtbpyiJc9t0Q%3D%3D&trackingId=sC5nrhFFFeBKs9J9z3%2B%2BXQ%3D%3D",
    "company_logo": null,
    "job_type": "Part-time",
    "job_level": "Entry-level",
    "competencies": {
        "programming_languages": [
            "JavaScript",
            "Java",
            "C#"
        ],
        "frameworks": [
            "React"
        ],
        "platforms": [
            "AWS"
        ],
        "tools": [
            "Git"
        ],
        "knowledge": [
            "Algorithms",
            "Data Structures",
            "Software Design"
        ],
        "soft_skills": [
            "Problem-solving",
            "Communication"
        ],
        "certifications": [
            "AWS Certified Solutions Architect",
            "PMI",
            "Scrum Master"
        ]
    },
    "company_addresses": null,
    "company_description": "With our expert teams spread across two continents, CODE LEAP provides innovative software solutions for venture-backed companies and leading enterprise businesses in Germany. Our teams in Germany and Ho Chi Minh City (Vietnam) work hand in hand to develop state-of-the-art solutions of the highest quality.\n\nBecause collaborating with the right people is the secret to our successful growth.\n\nWe future-proof organizations - be part of it!",
    "description": "## YOUR NEW ROLE CODE LEAP\n\nAs a Full-stack Engineer Intern at CODE LEAP, you will be integrated into a team where you will work on significant projects to enhance our products and streamline our services. This internship is designed to offer a comprehensive learning experience, allowing you to gain practical skills that align with your career objectives.\n\n## YOUR EXCITING TASKS\n\n*   Develop and maintain software components under the supervision of senior engineers\n*   Implement and test new features following coding standards and practices\n*   Assist in debugging and refining application functionalities\n*   Collaborate with the development team to discuss and solve problems\n*   Participate in software design sessions and contribute fresh ideas to enhance user experience\n*   Gain exposure to software architecture and project management processes\n*   Assist in the documentation of software functionality\n\n## YOUR PROFILE AND YOUR PERSONALITY\n\n*   Enrollment in an undergraduate or graduate program in Information Technology, Computer Science, Engineering, or a related field\n*   Demonstrated interest in technology and innovation, evidenced by previous projects or coursework (e.g., academic projects, internship experiences, or personal hobby projects,..)\n*   A foundational understanding of algorithms, data structures, and software design principles\n*   Basic understanding of programming languages such as JavaScript, Java, C#, …\n*   Experience with development tools and technologies (e.g., Git, version control systems)\n*   Strong problem-solving skills and a keen attention to detail.\n*   Eager to learn new technologies and frameworks.\n*   Proactively reach out to people, communicate, ask for help, and get things done\n*   Proficiency in the English (IELTS above 6.5 or CEFR B2+)\n\n## Nice to have\n\n*   Previous internship experience in software development is a plus\n\n## Benefits Await You At Code Leap\n\n*   Real-world experience in software development within a fast-paced industry.\n*   Mentorship from seasoned software engineers\n*   Allowance will be provided\n*   Enjoy a stress-free and comfortable commute to and from work with our Grab, Gojek Services sponsorship\n*   Enjoy an endless selection of delicious refreshments, including gourmet coffee, beverages, snacks, and fresh fruits, all complimentary\n*   Focused on individual development:\n    *   Unlimited access to Udemy and other recommendation courses\n    *   Sponsored Professional certificates such as AWS, PMI, Scrum Master, etc\n    *   Sharing session every Friday, come along with lunch provided by CODE LEAP\n*   Offers days off to align with personal university schedules and commitments\n*   Dynamic, fun, and agile environment, perfect for sharing and creativity\n*   Open-minded, kind & humble colleagues\n\n## CONTACT\n\nPlease submit your CV and a brief personal introduction via our website: https://en.codeleap.de/careers#Positions\n\nAdditionally, let us know your preference: coffee or tea?\n\nWere looking forward to your application!\n\nDue to the high volume of applications, we’ll be reaching out to shortlisted candidates only."
},
{
    "title": "Associate Software Engineer (Fresh Graduates Welcome)",
    "company": "OPSWAT",
    "location": "Ho Chi Minh City, Vietnam",
    "date_posted": "2025-05-31",
    "job_url": "https://vn.linkedin.com/jobs/view/associate-software-engineer-fresh-graduates-welcome-at-opswat-4243855074?position=8&pageNum=1&refId=82A%2BRMx58uSCqbk%2Bsf3BZw%3D%3D&trackingId=PvKXjutkzYVrPBZsqCte%2Bw%3D%3D",
    "company_logo": null,
    "job_type": "Full-time",
    "job_level": "Entry-level",
    "competencies": {
        "programming_languages": [
            "C++",
            "C#",
            "Python"
        ],
        "frameworks": [
            ".NET Core"
        ],
        "platforms": [
            "Windows",
            "Linux"
        ],
        "tools": [
            "Docker",
            "Git",
            "TeamCity",
            "Jira",
            "Confluence",
            "CD/CI pipelines"
        ],
        "knowledge": [
            "Data Structures",
            "Algorithms",
            "OOP",
            "Object-Oriented Programming",
            "OOD",
            "Object-Oriented Design",
            "System Design",
            "Machine Learning",
            "REST API",
            "Web",
            "Computer Science fundamentals",
            "Operating systems",
            "Computer systems",
            "Cybersecurity"
        ],
        "soft_skills": [
            "Logical thinking",
            "Critical thinking",
            "Problem-solving skills"
        ],
        "certifications": []
    },
    "company_addresses": null,
    "company_description": null,
    "description": "OPSWAT, a global leader in IT, OT, and ICS critical infrastructure cybersecurity, delivers an end-to-end platform that gives public and private sector organizations and enterprises the critical advantage needed to protect their complex networks, secure their devices, and ensure compliance. Over the last 20 years our commitment to innovative technology has earned the trust of more than 1,700 organizations, governments, and institutions globally, solidifying our role in protecting the world’s critical infrastructure and securing our way of life.\n\n**The Position**\n\nJoin our mission to build cutting-edge cybersecurity solutions! As a key Software Engineer in the Deep CDR team at OPSWAT, you will develop high-performance security products using C++ and C# (.NET Core) for both Windows and Linux. Youll work at the binary and structural levels of files, designing scalable back-end engines that process millions of files daily. In this role, youll also contribute to automation testing with Python, ensuring product reliability. Be part of an innovative team that values deep technical expertise in data structures, algorithms, OOP, and system design while tackling real-world cybersecurity challenges.\n\n**What You Will Be Doing**\n\n*   Design, implement, and test OPSWAT MetaDefender products built on C++ and C# (.NET Core) for both Windows and Linux environments.\n*   Build and develop an automation test framework using Python to ensure product quality and reliability.\n*   Interact with data, including files, documents, images, etc., at both binary and structural levels.\n*   Enrich features for existing software modules (back-end engines) which process millions of files daily, ensuring high performance and scalability.\n\n**What We Need From You**\n\n*   Bachelors or higher degree in Computer Science or related fields.\n*   Strong knowledge of Computer Science fundamentals, including data structures and algorithms, operating systems, and computer systems.\n*   Object-Oriented mindset, with expertise in OOP (Object-Oriented Programming) and OOD (Object-Oriented Design).\n*   Logical thinking, critical thinking, and problem-solving skills.\n*   Proficiency in English, particularly in reading and writing.\n\n**It Would be Nice if You Had**\n\n*   Programming experience with languages such as C++, C# or Python.\n*   Basic knowledge of machine learning.\n*   Experience with REST API and Web.\n*   Familiarity with Docker, CD/CI pipelines, Git, TeamCity, Jira, and Confluence.\n\nOPSWAT is an equal opportunity employer. We celebrate diversity and are committed to providing an environment where equal employment opportunities are extended to all employees and applicants, free of discrimination and harassment of any type. All employment decisions are based on individual qualifications, job requirements, and business needs without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other category protected by federal, state, or local laws.\n\nRecruiting Agencies: we do not accept unsolicited resumes from third party agencies for any of our open positions. To submit resumes for our jobs, there must be a recruiting contract approved by our legal team and endorsed by both parties. We are currently not accepting additional 3rd party agencies at this time."
},
{
    "title": "Backend Developer",
    "company": "Permate",
    "location": "Da Nang, Da Nang City, Vietnam",
    "date_posted": "2025-04-04",
    "job_url": "https://vn.linkedin.com/jobs/view/backend-developer-at-permate-4200510589?position=5&pageNum=2&refId=5AD%2F4nBmohLvaXphH1IzRw%3D%3D&trackingId=nPxpItQogpfdiRPevWMhKA%3D%3D",
    "company_logo": null,
    "job_type": "Full-time",
    "job_level": "Entry-level",
    "competencies": {
        "programming_languages": [
            "Python",
            "PHP",
            "Node.js"
        ],
        "frameworks": [],
        "platforms": [
            "AWS"
        ],
        "tools": [
            "Git",
            "CI/CD"
        ],
        "knowledge": [
            "OOP",
            "Algorithms",
            "Data Structures",
            "Design Patterns",
            "System Security"
        ],
        "soft_skills": [
            "Logical Thinking",
            "Analytical Skills",
            "Teamwork",
            "Proactive Attitude",
            "Professionalism",
            "Responsibility"
        ],
        "certifications": []
    },
    "company_addresses": "Lot 05 – Lot 06, Area A2, Phuong Trang High-Rise Commercial Urban Complex, Nguyen Sinh Sac Street, Hoa Minh Ward, Lien Chieu District, Da Nang, Vietnam",
    "company_description": null,
    "description": "## Backend Developer\n\n**Quantity:** 02\n\n**Working Hours:** 08:00 – 12:00, 13:30 – 17:30, Monday to Friday\n\n**Work Location:** Lot 05 – Lot 06, Area A2, Phuong Trang High-Rise Commercial Urban Complex, Nguyen Sinh Sac Street, Hoa Minh Ward, Lien Chieu District, Da Nang, Vietnam\n\n**Responsibilities**\n\n*   **General Responsibilities:**\n    *   Commit to contributing personal value toward the company’s and department’s common goals.\n    *   Commit to achieving personal objectives as set.\n*   **Key Job Responsibilities**\n    *   Develop and maintain backend systems for the company’s products.\n    *   Analyze project requirements and design database structures accordingly.\n    *   Build and optimize APIs based on project specifications.\n    *   Write technical documentation, including API documentation, and collaborate with relevant teams for implementation.\n    *   Work closely with cross-functional teams (e.g., Frontend, QA, Product) to ensure backend systems meet business and technical requirements.\n    *   Debug and troubleshoot issues in backend systems to ensure high performance and reliability.\n    *   Stay updated on industry best practices and integrate new technologies to improve backend systems.\n    *   Perform other tasks as assigned by the Board of Directors or department leaders.\n\n**Requirements**\n\n*   **Minimum Qualifications:**\n    *   **Experience:** At least 2 years of experience in Backend Development.\n    *   **Education:** A college/university degree or equivalent in Information Technology, Computer Science, or related fields.\n    *   **Programming Skills:** Proficiency in at least one backend programming language: Python, PHP, or Node.js.\n    *   **Core Knowledge:**\n        *   Strong foundation in OOP, algorithms, data structures, and design patterns.\n        *   Experience working with databases such as AWS Redshift, MySQL, or PostgreSQL.\n        *   Strong debugging skills and familiarity with writing unit tests.\n        *   Understanding of system security and best practices for securing backend systems.\n    *   **Tools & Workflow:**\n        *   Hands-on experience with source code management tools (e.g., Git).\n        *   Familiarity with CI/CD workflows and tools.\n    *   **Soft Skills:**\n        *   Strong logical thinking and analytical skills.\n        *   Ability to work both independently and collaboratively within a team.\n        *   A proactive attitude, professionalism, and a sense of responsibility.\n*   **Preferred Qualifications (Nice-to-Have)**\n    *   Experience in product-oriented projects, especially in Affiliate Marketing or SaaS platforms.\n    *   Proven ability to design and maintain microservices architectures.\n    *   Experience in deploying and maintaining systems with a large user base.\n    *   Familiarity with Agile/Scrum software development methodologies.\n    *   Experience integrating multiple data sources into a unified system.\n    *   Knowledge of AWS services and cloud-based deployments.\n\n**Benefits**\n\n*   **Salary:** 15,000,000 VND – 35,000,000 VND (based on experience and performance).\n*   **Performance Reviews:** Salary adjustments every 6 months based on demonstrated capability.\n*   **Equipment:** Fully equipped with necessary working devices (e.g., MacBook).\n*   **Probation Period:** Receive 85% of the official salary during the probation period.\n*   **Bonuses:** 13th-month salary and additional holiday bonuses throughout the year.\n*   **Health Check-Ups:** Annual check-ups at top-tier hospitals.\n*   **Insurance:** Full compliance with Vietnamese labor laws regarding social insurance and welfare benefits.\n*   **Leave:** 12 annual leave days and all Vietnamese public holidays.\n*   **Allowances:** Travel and lunch allowances, plus access to free drinks and coffee at the office’s mini bar.\n*   **Environment:** Work in a supportive and dynamic environment with talented and friendly colleagues.\n\n**How To Apply**\n\nSubmit your CV via email to: tuyendung@permate.com\n\n**Subject Line**: Application for Backend Developer Position – [Your Name]"
},
{
    "title": "Junior .NET Developer",
    "company": "NMS",
    "location": "Hanoi, Vietnam",
    "date_posted": "2025-05-04",
    "job_url": "https://vn.linkedin.com/jobs/view/junior-net-developer-at-nms-4207840997?position=5&pageNum=3&refId=q4twalXJ2TgtbpyiJc9t0Q%3D%3D&trackingId=rPEJhWirPmTjN%2FH%2B%2FBf8mQ%3D%3D",
    "company_logo": null,
    "job_type": "Full-time",
    "job_level": "Entry-level",
    "competencies": {
        "programming_languages": [
            ".NET",
            "ASP.NET",
            "SQL"
        ],
        "frameworks": [
            "MVC",
            "AngularJS"
        ],
        "platforms": [],
        "tools": [
            "SQL Server",
            "Git"
        ],
        "knowledge": [
            "OOP",
            "Database Design"
        ],
        "soft_skills": [
            "Communication",
            "Teamwork",
            "Problem-solving"
        ],
        "certifications": []
    },
    "company_addresses": "Tầng 3A Mỹ Đình Plaza, 138 Trần Bình, Hà Nội\n– Chi nhánh NMS Hòa Lạc: Tầng 8, Tòa nhà HTC Phú Cát, Khu công nghệ cao Hòa Lạc, Thạch Thất, Hà Nội\n– Chi nhánh NMS TP. Hồ Chí Minh: Lầu 3 – 385C – Nguyễn Trãi Quận 1 – TP. HCM\n– Chi nhánh Nhật Bản: 3F Hoshino Building, Nishi Shinjuku, Shinjuku, Tokyo",
    "company_description": null,
    "description": "**Job Description**\n\n*   Participate in system design analysis, database design, and detailed design.\n*   Participate in programming and testing Web Application (.NET) and Winform Application products.\n*   Work with ASP.NET – MVC – AngularJS…\n*   Work with .NET on Winform Application\n*   Improve and enhance project quality.\n\n**Benefits**\n\n*   Competitive income based on agreement\n*   “NMS care” insurance exclusively for NMS employees.\n*   Summer vacation: According to company policy (in May every year).\n*   Opportunity to be considered for salary increase twice a year, depending on work results.\n*   Modern and friendly working environment\n*   Labor policies comply with the “Labor Code” in Vietnam.\n\n**Requirements**\n\n*   At least 2 years of practical experience\n*   Graduated from University/College or programming training center in Information Technology.\n*   Proficient in ASP.NET programming language\n*   Knowledge of jQuery, Javascript, HTML, CSS, SQL Server\n*   Understanding and grasping the rules and concepts of OOP programming\n*   Good self-learning and research skills\n*   Fairly good communication English in work (Multinational environment)\n*   Quickly read and understand specialized English documents (for Google search purposes)\n*   Quick, eager to learn, highly responsible, honest, and careful.\n*   Oriented to develop yourself according to Japanese working style\n\n**Working location:**\n\nTầng 3A Mỹ Đình Plaza, 138 Trần Bình\n\n**Apply Now**\n\nMs. Huyền: 0969.709.429 / mail:huyenlt@nms.com.vn / skype:huyenthu.hr\n\n——————————–\n\nCông ty cổ phần Dịch vụ Di động Thế Hệ Mới (NMS)\n\n**Headquarters System**\n\n*   NMS headquarters: Tầng 3A Mỹ Đình Plaza, 138 Trần Bình, Hà Nội\n*   NMS Hoa Lac Branch: 8th Floor, HTC Phu Cat Building, Hoa Lac High-Tech Park, Thach That, Hanoi\n*   NMS Ho Chi Minh City Branch: 3rd Floor – 385C – Nguyen Trai District 1 – TP. HCM\n*   Japan Branch: 3F Hoshino Building, Nishi Shinjuku, Shinjuku, Tokyo\n\n☎ Phone: 024.7300 8555\n\n🌎 Website: https://nms.com.vn/"
},
{
    "title": "Software Engineer - Frontend",
    "company": "ShopBack",
    "location": "Ho Chi Minh City Metropolitan Area",
    "date_posted": "2025-05-28",
    "job_url": "https://vn.linkedin.com/jobs/view/software-engineer-frontend-at-shopback-4162273156?position=3&pageNum=2&refId=5AD%2F4nBmohLvaXphH1IzRw%3D%3D&trackingId=nzUUrdyLh0VRkyfdKzlFWA%3D%3D",
    "company_logo": null,
    "job_type": "Full-time",
    "job_level": "Entry-level",
    "competencies": {
        "programming_languages": [
            "JavaScript",
            "TypeScript"
        ],
        "frameworks": [
            "ReactJS"
        ],
        "platforms": [],
        "tools": [
            "Git",
            "Docker",
            "Jenkins",
            "Kubernetes",
            "Terraform"
        ],
        "knowledge": [
            "RESTful APIs",
            "Algorithms",
            "Data Structures"
        ],
        "soft_skills": [
            "Teamwork",
            "Mentoring"
        ],
        "certifications": []
    },
    "company_addresses": null,
    "company_description": null,
    "description": "## Our Journey\n\nShopBack started as a spark of inspiration one night in 2014 when Henry and Joel were brainstorming ideas in Henry’s car. That lightbulb moment — earning Cashback while shopping online — was just the beginning. Fueled by the countless possibilities, the team locked themselves in a hotel room for 24 hours to code the very first prototype. Their mission? To revolutionize shopping by helping advertisers market more cost-effectively, while making every purchase more rewarding for shoppers.\n\nToday, ShopBack is the leading shopping, rewards, and payments platform in Asia-Pacific, empowering 45 million shoppers across 12 markets. With 20,000+ partners and over half a million transactions daily, we’re redefining the way the world shops. As we expand globally, we’re looking for adventurous, driven individuals to help us build\n\nThe World’s Most Rewarding Way to Shop\n.\n\n## About The Role\n\nWe are seeking team members who strive to solve hard problems, take pride in delivering world-class products, and are strong team players.\n\nYou are someone who wants to see the impact of your work making a difference every day. You find passion in the craft and are constantly seeking improvement and better ways to solve tough problems.\n\n## Your Adventure Ahead\n\n*   Contribute to the ideation, technical design, implementation, and testing of product features that empower our business and deliver impact to our customers.\n*   Produce high-quality software following good architecture and design principles that are scalable.\n*   Design and deliver well-thought-out user interfaces with a strong sense of the overall user experience.\n*   Collaborate with the team to define the future of the ShopBack experience.\n*   Strong mentoring skills with the ability to provide technical guidance and review code.\n\n## Essentials To Succeed\n\n*   2+ years of experience building and designing delightful user experiences as a frontend engineer.\n*   Good knowledge of HTML, CSS, and JavaScript.\n*   Understanding of good software design principles and have applied principles to professional work.\n*   Hands-on experience working with ReactJS (Preferred) and ecosystem.\n*   Have knowledge in Test Driven Development (TDD), CI/CD.\n*   Familiarity with RESTful APIs and TypeScript.\n*   Ability to work effectively in a fast-paced, complex technical environment with high adaptability and flexibility.\n\n## ShopBackers DNA\n\n*   **Grit** - We tackle all challenges head-on, working together to solve problems and achieve success.\n*   **Hunger** - We value hard work, and having relentless drive.\n*   **Speed** - We move fast and have a bias for action, all to deliver maximum impact.\n*   **Impact** - We focus on results, always aiming for the best possible outcomes and timelines.\n*   **Growth** - We embrace a growth mindset, constantly striving to learn, improve, and excel in our roles.\n\n## Exclusively for ShopBackers\n\n*   Career progression paths and opportunities to take on greater challenges that help you realise your ambitions.\n*   Be part of a winning team on a journey to global scale.\n*   Competitive compensation based on your performance.\n*   Candid, open, and collaborative culture where feedback is valued, for everyone to grow and improve every day.\n*   Work-From-Anywhere benefit to enable you to thrive personally and professionally.\n\nShopBack is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. We do not discriminate on the basis of race, color, religion, sexual orientation, national origin, age, disability, genetic information, veteran status, or any other protected status under applicable laws. Join our team and help us make a difference!\n\nWe are committed to protecting your data and ensuring fairness in our recruitment process. As part of this process, we use AI tools to assist with tasks such as application screening and candidate matching. These tools are designed to enhance efficiency and reduce bias, and their use complies with applicable data protection laws and our commitment to fair employment practices. Your personal data will be processed securely and transparently, and final hiring decisions are always made by our recruitment team, not by automated systems. If you have any questions about how your data is used, or wish to exercise any of your rights including the right to such processing, please contact us at dpo@shopback.com."
},
{
    "title": "Frontend Developer (React.js)",
    "company": "Relia Software - Reliable Software Development Company",
    "location": "Phu An Village, Vietnam",
    "date_posted": "2025-05-04",
    "job_url": "https://vn.linkedin.com/jobs/view/frontend-developer-react-js-at-relia-software-reliable-software-development-company-4212162939?position=4&pageNum=3&refId=q4twalXJ2TgtbpyiJc9t0Q%3D%3D&trackingId=2D3vkzuzPqifiibgkCk8bA%3D%3D",
    "company_logo": null,
    "job_type": "Full-time",
    "job_level": "Mid-Senior level",
    "competencies": {
        "programming_languages": [
            "JavaScript",
            "HTML",
            "CSS",
            "ES6"
        ],
        "frameworks": [
            "React",
            "React.js",
            "Vue",
            "TypeScript",
            "MVC",
            "MVVM"
        ],
        "platforms": [],
        "tools": [
            "Git",
            "Node.js"
        ],
        "knowledge": [
            "Data Structures",
            "Algorithms",
            "Virtual DOM"
        ],
        "soft_skills": [
            "Problem-solving",
            "Analytical thinking",
            "Teamwork",
            "Communication"
        ],
        "certifications": []
    },
    "company_addresses": null,
    "company_description": null,
    "description": "**Core Responsibilities**\n\n*   Collaborate with the development team to discuss UI ideas and application requirements.\n*   Review application needs, identifying web-based user interactions.\n*   Develop and implement responsive UI components using React concepts.\n*   Write interface codes in JavaScript following React.js workflows.\n*   Troubleshoot and debug front-end code, improving performance and user experience.\n*   Create and maintain front-end architecture supporting UI concepts.\n*   Document application changes and updates.\n*   Maintain brand consistency throughout the design.\n*   Implement integration/unit tests to ensure reliable UI behavior.\n\n**Skills & Qualifications**\n\n*   3+ years of experience in React.js.\n*   Proficiency in JavaScript, CSS, HTML, ES6, with solid fundamentals.\n*   Knowledgeable in data structures and algorithms.\n*   Proficiency in front-end frameworks (React, Vue, TypeScript) and development models (MVC, MVVM), with an understanding of virtual DOM principles.\n*   Experience with Git version control and Node.js (for SSR implementations).\n*   Strong skills in front-end performance optimization.\n*   Strong problem-solving abilities, analytical thinking, and teamwork skills.\n*   Fluent English communication.\n*   Preferably holds a Bachelor’s degree in IT, Computer Science, or related fields.\n\n**Benefits**\n\n*   100% salary during probation.\n*   5-day workweek, Monday to Friday (9 am–6 pm).\n*   Flat organization with open communication.\n*   Friendly, flexible working environment.\n*   Career development opportunities, working alongside English-speaking developers.\n*   13th-month salary, insurance.\n*   Annual team-building event with a ticket for one accompanying relative."
},
{
    "title": "AI Engineer (Fresher, Sinh Viên)",
    "company": "ĐÚNG NGƯỜI ĐÚNG VIỆC Community",
    "location": "Hanoi, Vietnam",
    "date_posted": "2025-05-28",
    "job_url": "https://vn.linkedin.com/jobs/view/ai-engineer-fresher-sinh-vi%C3%AAn-at-%C4%91%C3%BAng-ng%C6%B0%E1%BB%9Di-%C4%91%C3%BAng-vi%E1%BB%87c-community-4236766325?position=2&pageNum=2&refId=5AD%2F4nBmohLvaXphH1IzRw%3D%3D&trackingId=R88pj0EibBfwWjW%2BOHTp0w%3D%3D",
    "company_logo": null,
    "job_type": "Full-time",
    "job_level": "Intern",
    "competencies": {
        "programming_languages": [
            "Python",
            "C/C++"
        ],
        "frameworks": [
            "FastAPI",
            "Flask",
            "Django",
            "Tensorflow",
            "Pytorch",
            "DGL",
            "PyG",
            "Onnx"
        ],
        "platforms": [],
        "tools": [
            "Git",
            "Docker",
            "Kubernete",
            "Kubeflow",
            "MLFlow",
            "TritonServer",
            "Tensorflow Serving"
        ],
        "knowledge": [
            "Computer Vision",
            "NLP",
            "Supervised learning",
            "Reinforcement learning",
            "Image Processing",
            "Video Processing",
            "Audio Processing",
            "Natural Language Processing",
            "CNN",
            "RNN",
            "Transformer",
            "Attention",
            "SVM",
            "KNN",
            "Clustering",
            "GNN",
            "Knowledge Distiller",
            "Model Prune",
            "Model Quantization"
        ],
        "soft_skills": [],
        "certifications": []
    },
    "company_addresses": null,
    "company_description": null,
    "description": "Mô tả công việc\n\nTham gia phát triển, ứng dụng, tối ưu, tích hợp mô hình AI cho các bài toán ứng dụng trong hoạt động Kinh doanh/Ngân hàng về các lĩnh vực Computer Vision, NLP...\n\nTham gia vào các công đoạn triển khai dịch vụ: Kiến trúc hệ thống, thiết kế mô hình hoạt động, luồng hoạt động, chức năng, tối ưu performance\n\nTham gia Coding, test metrics, service và unittest theo mô hình DevOps, MLOps\n\nTham gia nghiên cứu, tìm hiểu các bài báo khoa học mới nhất về AI, ML, DL\n\nTham gia các chương trình đào tạo và dự án dành cho Trainee để phát triển lên các vị trí chính\n\nYêu cầu công việc\n\nSinh viên năm 4, tốt nghiệp dưới 01 năm Đại học các chuyên ngành: Công nghệ thông tin, Khoa học máy tính, Điện tử viễn thông, Công nghệ phần mềm, Hệ thống thông tin....\n\nCó kiến thức và kỹ năng nền tảng về:\n\n*   Ngôn ngữ lập trình: Python, C/C++\n*   Service/MicroService với một trong các framework FastAPI/Flask/Django\n*   Tensorflow/Pytorch/DGL/PyG/Onnx\n*   API (Restful/gRPC), Lập trình an toàn, đảm bảo & tối ưu hiệu năng\n*   Git và Git Flow, Docker/ Kubernete, Kubeflow/MLFlow, TritonServer/ Tensorflow Serving\n*   Các dạng bài toán Supervised learning, Reinforcement learning\n*   Xử lý Ảnh (Computer Vision)/Video/Âm thanh/Ngôn ngữ tự nhiên (NLP)\n*   CNN/RNN/Transformer/Attention, SVM/KNN/Clustering, GNN vv...\n*   Kỹ thuật Knowledge Distiller/ Model Prune, Model Quantization\n\nTại sao bạn yêu thích làm việc tại đây\n\nThu nhập : Thoã Thuận\n\nBảo hiểm\n\nDu Lịch\n\nPhụ cấp\n\nDu lịch nước ngoài\n\nPhụ cấp thâm niên\n\nCông tác phí\n\nTăng lương\n\nChăm sóc sức khỏe\n\nThưởng\n\nChế độ nghỉ phép\n\nChế độ tập thể dục"
},
{
    "title": "BACKEND DEVELOPER",
    "company": "Monkey Vietnam",
    "location": "Hanoi, Hanoi, Vietnam",
    "date_posted": "2025-05-14",
    "job_url": "https://vn.linkedin.com/jobs/view/backend-developer-at-monkey-vietnam-4223323621?position=6&pageNum=3&refId=q4twalXJ2TgtbpyiJc9t0Q%3D%3D&trackingId=tfLEuBHQ3wp7rY%2FnsSlsIw%3D%3D",
    "company_logo": null,
    "job_type": "Full-time",
    "job_level": "Entry-level",
    "competencies": {
        "programming_languages": [
            "Golang",
            "PHP",
            "Go"
        ],
        "frameworks": [
            "Laravel",
            "Angular",
            "React"
        ],
        "platforms": [],
        "tools": [
            "Docker",
            "Kubernetes",
            "CI/CD"
        ],
        "knowledge": [
            "SQL",
            "OOP",
            "Design Patterns"
        ],
        "soft_skills": [
            "Teamwork"
        ],
        "certifications": []
    },
    "company_addresses": null,
    "company_description": null,
    "description": "**Description**\n\n*   Develop and optimize the backend system using Golang or Laravel\n*   Design, build, and maintain high-performance APIs to meet the expanding needs of the product\n*   Proactively seek and apply AI solutions to improve performance, optimize processes, or enhance user experience\n*   Work closely with frontend, QA, and other teams to ensure the consistency and stability of the system\n*   Solve performance, security, and system optimization issues\n\n**Requirements**\n\n*   At least 1 year of programming experience\n*   Proficient in at least one of the programming languages Go, PHP\n*   Knowledge and understanding of at least one Frontend language such as Angular, React...\n*   Solid understanding of OOP, object-oriented design, and basic Design Patterns\n*   Ability to read and understand specialized English documents fairly well\n*   Possess a sense of ownership of work (positive, proactive, decisive)\n*   Have a spirit of continuous self-development, be progressive, eager to learn, and like to research new technologies\n*   Good teamwork skills\n*   Send CV to email: phuong.tran@monkey.edu.vn\n\n**Preferred candidates**\n\n*   Deep understanding of SQL\n*   Have applied AI in work & seen real impact in work in at least the last 3 months\n*   Understanding of CI/CD, Docker, Kubernetes, DevOps\n*   Ability to present and Train\n\n**Benefits**\n\n*   Salary from 17,000,000 - 20,000,000 VND/month\n*   Allowance of 1,000,000 VND/month for lunch and gasoline\n*   Unlimited use of Monkey products\n*   Large data warehouse, with products for over 15 million users\n*   Mentor with good expertise & creates conditions to develop personal capacity\n*   Opportunity to research and improve AI application skills\n*   Working at a company that has won many prestigious awards such as First Prize for Global Initiative in the US awarded by US President Barack Obama; First Prize for Vietnamese Talents; Top 1 favorite childrens application on the App Store and Google Play….\n*   Working in a positive, open environment, ready to listen and share from bosses to colleagues\n*   Sponsored costs for courses to develop personal expertise\n*   Consideration for annual salary increase\n*   Productivity bonus, project bonus, innovation bonus, acceleration bonus, hot bonus, bonus when thinking of new ways to reward; gifts and bonuses for holidays and Tet\n*   Equipped with equipment for work or allowance if using personal equipment\n*   Full number of days of leave, holidays, Tet, personal leave in accordance with the provisions of the Labor Law\n*   Attractive maternity regime for men and women\n*   Enjoy social insurance, health insurance, unemployment insurance and other benefits according to the companys regulations\n*   Periodic health check-ups with high-quality examination packages at major medical facilities\n*   Enjoy the joy of not only benefits: Teabreak every day, weekly parties, monthly birthdays, annual travel\n*   And many other attractive welfare policies will be discussed at the Interview\n\nShare\nCopy link"
},
{
    "title": "Backend Developer",
    "company": "NMS",
    "location": "Hanoi, Vietnam",
    "date_posted": "2025-05-04",
    "job_url": "https://vn.linkedin.com/jobs/view/backend-developer-at-nms-4207842806?position=3&pageNum=3&refId=q4twalXJ2TgtbpyiJc9t0Q%3D%3D&trackingId=f4WB4YEndpj5SfMTWtC1sw%3D%3D",
    "company_logo": null,
    "job_type": "Full-time",
    "job_level": "Entry-level",
    "competencies": {
        "programming_languages": [
            "Python",
            "Golang"
        ],
        "frameworks": [],
        "platforms": [],
        "tools": [
            "Jenkins",
            "Kubernetes",
            "Docker"
        ],
        "knowledge": [
            "Design pattern",
            "microservice",
            "multi-tenancy architecture",
            "Iaas",
            "Paas",
            "Saas",
            "Agile",
            "Scrum",
            "NoSQL",
            "Redis",
            "Kafka",
            "CI/CD",
            "Security"
        ],
        "soft_skills": [],
        "certifications": []
    },
    "company_addresses": null,
    "company_description": null,
    "description": "**JOB DESCRIPTION**\n\nParticipate in research and development of network security solutions:\n\n*   Monitor and detect attacks.\n*   Manage information security for organizations/businesses.\n*   Analyze requirements, design systems.\n*   Optimize system performance.\n\n**REQUIREMENTS**\n\n*   Good at programming, especially Python/Golang\n*   1-1.5 years of experience or more\n*   Good thinking, quick grasp of technology.\n*   Priority is given to candidates (not all required):\n*   Knowledge of Design patterns and system design.\n*   Experience in optimizing systems/participating in large projects with a significant number of users.\n*   Experience working with centralized log collection and analysis systems.\n*   Know how to use NoSQL, Redis, Kafka technologies.\n*   Priority is given to candidates:\n*   Experience working in projects using CI/CD\n*   Knowledge of Iaas/Paas/Saas and microservice, multi-tenancy architecture models\n*   Understanding and practical experience with projects running according to Agile/Scrum models\n*   Experience using tools: Jenkins, kubernetes, Docker.\n\n**BENEFITS**\n\n*   Competitive income: $600 - $1000\n*   “NMS care” insurance exclusively for NMS employees.\n*   Summer vacation: According to company policy (in May-June every year).\n*   Opportunity to be considered for salary increase twice a year, depending on work results.\n*   Modern and friendly working environment.\n*   Labor policies comply with the “Labor Code” in Vietnam."
},
{
    "title": "Software Engineer Intern - Frontend",
    "company": "ShopBack",
    "location": "Ho Chi Minh City Metropolitan Area",
    "date_posted": "2025-06-03",
    "job_url": "https://vn.linkedin.com/jobs/view/software-engineer-intern-frontend-at-shopback-4239023783?position=2&pageNum=3&refId=q4twalXJ2TgtbpyiJc9t0Q%3D%3D&trackingId=HKUSPdNnt3KhyQbIwayuZQ%3D%3D",
    "company_logo": null,
    "job_type": "Internship",
    "job_level": "Intern",
    "competencies": {
        "programming_languages": [
            "JavaScript",
            "HTML",
            "CSS"
        ],
        "frameworks": [
            "Angular",
            "Ember",
            "Vue",
            "React",
            "Rails",
            "Django",
            "Spring",
            "Nestjs",
            "Nextjs"
        ],
        "platforms": [],
        "tools": [],
        "knowledge": [],
        "soft_skills": [
            "Communication",
            "Teamwork",
            "Problem-solving"
        ],
        "certifications": []
    },
    "company_addresses": null,
    "company_description": null,
    "description": "Our Journey\n\nShopBack started as a spark of inspiration one night in 2014 when Henry and Joel were brainstorming ideas in Henry’s car. That lightbulb moment — earning Cashback while shopping online — was just the beginning. Fueled by the countless possibilities, the team locked themselves in a hotel room for 24 hours to code the very first prototype. Their mission? To revolutionize shopping by helping advertisers market more cost-effectively, while making every purchase more rewarding for shoppers.\n\nToday, ShopBack is the leading shopping, rewards, and payments platform in Asia-Pacific, empowering 45 million shoppers across 12 markets. With 20,000+ partners and over half a million transactions daily, we’re redefining the way the world shops. As we expand globally, we’re looking for adventurous, driven individuals to help us build\n\nThe World’s Most Rewarding Way to Shop\n.\n\nYour Adventure Ahead\n\n*   Build stable, performant and highly available applications for our customers, merchants, and operators\n*   Work on modern frontend web applications\n*   Design and build APIs for meaningful user experiences on web and mobile\n*   Improving and automating engineering processes to improve delivery velocity and quality\n\nEssentials To Succeed\n\n*   Strong knowledge of HTML, CSS, and JavaScript\n*   Some experience with relational or non-relational databases\n*   Strong written and verbal communication skills\n*   Active team player with strong problem-solving skills\n*   Attention to detail and demonstrable design and UX sensibilities\n*   Experience with client-side frameworks is a plus (Angular, Ember, Vue, React etc)-- Needed\n*   Experience with server-side frameworks is a plus (Rails, Django, Spring, Nestjs, Nextjs etc)\n*   Applicants from all varsities are welcome to apply, including University, Polytechnic, and ITE\n*   Minimum commitment period of 6 months, full-time\n\nShopBackers DNA\n\n**Grit** -\nWe tackle all challenges head-on, working together to solve problems and achieve success.\n\n**Hunger**\n- We value hard work, and having relentless drive.\n\n**Speed** -\nWe move fast and have a bias for action, all to deliver maximum impact.\n\n**Impact** -\nWe focus on results, always aiming for the best possible outcomes and timelines.\n\n**Growth** -\nWe embrace a growth mindset, constantly striving to learn, improve, and excel in our roles.\n\nExclusively for ShopBackers\n\n*   Career progression paths\nand opportunities to take on greater challenges that help you realise your ambitions.\n*   Be part of a winning team\non a journey to global scale.\n*   Competitive compensation\nbased on your performance.\n*   Candid, open, and collaborative culture\nwhere feedback is valued, for everyone to grow and improve every day.\n\nShopBack is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. We do not discriminate on the basis of race, color, religion, sexual orientation, national origin, age, disability, genetic information, veteran status, or any other protected status under applicable laws. Join our team and help us make a difference!\n\nWe are committed to protecting your data and ensuring fairness in our recruitment process. As part of this process, we use AI tools to assist with tasks such as application screening and candidate matching. These tools are designed to enhance efficiency and reduce bias, and their use complies with applicable data protection laws and our commitment to fair employment practices. Your personal data will be processed securely and transparently, and final hiring decisions are always made by our recruitment team, not by automated systems. If you have any questions about how your data is used, or wish to exercise any of your rights including the right to such processing, please contact us at dpo@shopback.com ."
},
{
    "title": "Java Intern",
    "company": "DXC Technology Vietnam",
    "location": "Ho Chi Minh City, Vietnam",
    "date_posted": "2025-05-04",
    "job_url": "https://vn.linkedin.com/jobs/view/java-intern-at-dxc-technology-vietnam-4201673171?position=1&pageNum=3&refId=q4twalXJ2TgtbpyiJc9t0Q%3D%3D&trackingId=Hwk0Zt5Cu408NxEBICW%2BIA%3D%3D",
    "company_logo": null,
    "job_type": "Internship",
    "job_level": "Intern",
    "competencies": {
        "programming_languages": [
            "Java"
        ],
        "frameworks": [],
        "platforms": [],
        "tools": [],
        "knowledge": [
            "Object-oriented programming",
            "Databases"
        ],
        "soft_skills": [],
        "certifications": []
    },
    "company_addresses": null,
    "company_description": null,
    "description": "How would you like to join an international software development center in Vietnam to learn, to grow personally as well as professionally, and to gain valuable experience in a fast-paced development environment?\n\nAn exciting and challenging opportunity for a Entry-Level Java Software Engineer has been available for those who are passionate about learning and building applications using Java technologies. Your primary responsibilities will include develop, and maintenance and perform assurance of software products. The successful candidate will be part of a high-performing development team in a high frequency/low latency environment.\n\n**Requirements**\n\n*   University graduated students of Computer Science, Information Technology, Software Engineering, or related technical field.\n*   Can communcate in English, have English certificate (TOEIC/IELTS).\n*   Sufficient knowledge of Object-oriented programming concept.\n*   Has knowledge of Java, Databases.\n*   Having working knowledge on software development or related technologies would be advantageous.\n*   Fully committed to joining the whole program\n*   Committed to working at DXC Vietnam for minimum 30 months after completing the DECP Program\n\n**Benefits**\n\n*   Allowance: 5,000,000 VND/month.\n*   1-on-1 mentorship throughout the program.\n*   Comprehensive training with a professional curriculum.\n*   Hands-on experience working on real projects.\n*   High potential to become a full-time employee upon completion of the training program.\n*   Dynamic and youthful work environment with plenty of growth opportunities.\n*   Free DXC Learning Account (partner with Udemy and LinkedIn)."
},
{
    "title": "Web App Developer",
    "company": "Samsung Electronics HCMC CE Complex",
    "location": "Ho Chi Minh City Metropolitan Area",
    "date_posted": "2025-01-04",
    "job_url": "https://vn.linkedin.com/jobs/view/web-app-developer-at-samsung-electronics-hcmc-ce-complex-4095148390?position=4&pageNum=0&refId=yEZjo%2BIez2aR1YOZPIU%2BxQ%3D%3D&trackingId=sFM%2BlyAIhNIspc0qkNpjqA%3D%3D",
    "company_logo": null,
    "job_type": "Full-time",
    "job_level": null,
    "competencies": {
        "programming_languages": [
            "JavaScript",
            "Typescript",
            "HTML5"
        ],
        "frameworks": [
            "Antd design",
            "Tailwind",
            "flow bite",
            "material design"
        ],
        "platforms": [],
        "tools": [
            "ESLint",
            "Jest",
            "Mocha",
            "Cypress",
            "Webpack",
            "Git",
            "SVN",
            "Bluetooth",
            "Socket",
            "MQTT",
            "WebRTC",
            "OpenCV",
            "TensorFlow"
        ],
        "knowledge": [
            "Clean Architecture",
            "design patterns",
            "MVC",
            "MVVM",
            "OOP",
            "CI/CD principles",
            "IoT connection",
            "Algorithm",
            "Data Structures"
        ],
        "soft_skills": [
            "problem analysis",
            "problem resolution",
            "multi-task",
            "manage tasks",
            "teamwork"
        ],
        "certifications": []
    },
    "company_addresses": null,
    "company_description": null,
    "description": "**Position Summary**\n\n**Role and Responsibilities**\n\n**JOB RESPONSIBILITIES:**\n\n*   Develop and maintain web-based mobile applications for smart devices and robot.\n*   Actively participate in the development process, taking responsibility for and completing assigned tasks.\n*   Analyze and effectively solve problems that arise during project development.\n*   Research, propose and implement solutions to improve project quality.\n*   Collaborate, support team members and other departments during work.\n\n**Skills And Qualifications**\n\n**KNOWLEDGE, QUALIFICATION AND EXPERIENCE**\n\n**General Requirement**\n\n*   Bachelor’s degree in computer science, Software Engineering or a related IT field.\n*   At least 1 year of experience in software development.\n*   Proficient in English for work purposes.\n*   Strong skills in problem analysis and resolution.\n*   Fast learner with a mindset geared toward quickly understanding new technologies and product modules.\n*   Ability to multi-task and manage tasks with varying priorities.\n*   Tech-savvy and passionate about building products.\n*   Proactive at work\n\n**Technical Requirement**\n\n**(Mandatory)**\n\n*   Knowledge in Web application technical programing: JavaScript, Typescript, CSS, HTML5, …\n*   Good at handling Web applications across multiple screens size.\n*   Familiarity with ESLint for maintaining code quality and style.\n*   Experience in using and customizing component UI frameworks such as Antd design, Tailwind - flow bite, material design.\n*   Understanding of W3C standards and experience in handling W3 error compliance.\n*   Experience in writing and executing unit tests for web applications (Jest, Mocha, Cypress).\n*   Knowledgeable in Clean Architecture, design patterns (MVC, MVVM) and OOP.\n*   Experience with distributed version control systems (Git, SVN).\n\n**(Optional)**\n\n*   Proficient in using Webpack for module bundling and optimizing web applications.\n*   Strong understanding of CI/CD principles.\n*   Knowledge & experience of handling IoT connection: Bluetooth, Socket, MQTT, IoT server\n*   Have experience of chat application (WebRTC, …)\n*   Have experience of software quality & performance\n*   Knowledge of image/video detection libraries (OpenCV, TensorFlow) will be highly appreciated\n*   Experience in Android/IOS development (native & cross-platform) is big plus\n*   Familiar with Algorithm or have high level on Coding challenge platform like Leet code, Hacker Rank is a big plus\n\nEMAIL: NGUYEN.LT@SAMSUNG.COM\n\nPlease visit Samsung membership to see Privacy Policy, which defaults according to your location. You can change Country/Language at the bottom of the page. If you are European Economic Resident, please click here."
},
{
    "title": "Developer for website/application",
    "company": "CT",
    "location": "Ho Chi Minh City, Vietnam",
    "date_posted": "2024-08-04",
    "job_url": "https://vn.linkedin.com/jobs/view/developer-cho-website-%E1%BB%A9ng-d%E1%BB%A5ng-at-ct-3984642638?position=1&pageNum=0&refId=yEZjo%2BIez2aR1YOZPIU%2BxQ%3D%3D&trackingId=FmgzgA9wFuJSaeDrcdBtmA%3D%3D",
    "company_logo": null,
    "job_type": "Full-time",
    "job_level": "Entry-level",
    "competencies": {
        "programming_languages": [
            "Node.js",
            "JavaScript"
        ],
        "frameworks": [],
        "platforms": [
            "iOS",
            "Android"
        ],
        "tools": [],
        "knowledge": [],
        "soft_skills": [],
        "certifications": []
    },
    "company_addresses": null,
    "company_description": null,
    "description": "**Job Description**\n\n**Responsibilities:**\n\n*   Implement websites/applications according to requirements.\n*   Support the customer service department and sales team.\n\n**Requirements:**\n\n*   3+ years of experience as a developer.\n*   Experience with Node.js (a plus).\n*   Experience with MongoDB (a plus).\n*   Experience with JavaScript (a plus).\n*   Mobile development experience (iOS/Android) (a plus).\n*   Intermediate English proficiency (a plus).\n\n**Benefits:**\n\n*   Income: above 20,000,000 VND and fixed (negotiated during the interview), bonuses, allowances.\n*   Work for an advanced Korean AI business.\n*   Work with advanced companies from Korea, China, Japan, Vietnam.\n*   Insurance as per Vietnamese law.\n*   Work in a competitive and developing environment, with opportunities to work with other advanced companies from Korea.\n*   University"
}
]